{"ENFJ": {"Strengths and Weaknesses": {"Strengths": {"Peacekeeping": "You not only work to promote harmony and morale while deflecting potential conflicts, you are also deft in persuading and motivating others to get moving in the same direction. You see positive relationships as the sure path to fulfilment and are highly cooperative, promoting cohesion and even friendship within the workplace and beyond. ", "Communication": "One of the many keys to your success is the ability to communicate proficiently across diverse media. You have a talent for making words out of ideas whether it is in the classroom or in a love letter. You love writing, talking and telling stories, and your audiences are often equally as enthusiastic to receive what they have to say. As comfortable in large crowds as small groups, you like to be the centre of attention and thrive on the energy of good conversation, especially with people who are as passionate as you are. ", "Persuasiveness": "You are known for your powers of persuasion and are generally effective in getting people to do what they want them to do. But you are charitable; the motive is not often manipulation or personal gain, you simply want people to do more or better because it will benefit them or help them realize some potential. These personalities are likeable and trustworthy and, as a result, others are generally compelled to listen to and follow them. ", "Leadership": "You have a solid social circle and are likely to be the ones planning events and finding opportunities to get people together. Your leadership skills ensure that others quickly jump on board and are excited about it. Teaching and mentoring come as easily to them as breathing and talking, making you particularly skilled in endeavors that allow you to lead, train or educate. Your idealism helps you to very clearly and accurately see the potential in other people and entities, and your Judging element helps you to map out the path to get there."}, "Weaknesses": {"Leap before looking": "Passionate and headstrong, you tend to dive in headfirst without fully examining or investigating the endeavour in front of them, or fully considering what it will entail. Your Intuitive nature gets the best of them and they are quite sure they have it all figured out; you may not concern yourself with the necessary and important details. ", "Overcommitment": "Though they thrive on being a little overwhelmed, you can easily become over-committed because you are genuinely excited about life and all of the opportunities they see before you—you want to say “yes” as much as you can and you want to do it all. As a result, you may later have to pull out of commitments you might have examined more carefully before jumping in, and often end up starting and stopping many things without finishing. ", "Struggle to make tough decisions. ": "When making decisions, you can struggle with information that seems to lack a human element. Hard logic, impersonal reasoning and data-based conclusions can be difficult and even undesirable. While you may be viewed as compassionate, you may also be seen as unfair since they are likely to prioritize the needs of the individual above the whole and to look more readily to the exceptions than the rules. ", "Too selfless": "Because you prioritize people and the needs of others, you may not be properly in touch with your own needs and can struggle, at times, to express them if you fear that doing so may create conflict or disunity. If you have not developed a strong sense of self you may fail to be authentic in your relationships. As you already tend toward loneliness, the sense that no one truly knows you can foment the sense of being alone and misunderstood. "}}, "Personality Description": {"Name": "The Educator", "Two Line Description": " You're driven to bring about positivity in the lives around you without being selfish.", "Description": "You are an idealist organizer, driven to implement their vision of what is best for humanity. You often act as catalysts for human growth because of your ability to see potential in other people and your charisma in persuading others to your ideas. You are focused on values and vision, and are passionate about the possibilities for people.\nYou are typically energetic and driven, and often have a lot on their plates. You are tuned into the needs of others and acutely aware of human suffering; however, you also tend to be optimistic and forward-thinking, intuitively seeing opportunity for improvement. You are ambitious, but your ambition is not self-serving: rather, you feel personally responsible for making the world a better place.", "Where do you prefer to focus your energy and attention?": ["1. You are sociable and outgoing. ", "2. You draw your energy from the outside world. ", "3. You talk about your thoughts and feelings and have great communication skills. ", "4. You are adaptable to every situation and are innovative when problems arise. ", "5. You are good at multitasking and prefer to work in a team rather than individually. ", "6. You look for inspiration and ideas from outside sources."], "How do you grasp and process the information?": ["1. You are imaginative and think out of the box. ", "2. You are innovative, hypothetical and have a futuristic approach towards life. ", "3. You are highly observant and a deep thinker. ", "4. You are aware of yourself and your surroundings. ", "5. You prefer to read between the lines and recognise the connection between random facts ", "6. Ideas inspire you and you are more likely to focus on the theory than the practice of a project."], "How do you make the decisions?": ["1. You decide with heart and dislike conflict. ", "2. You are passionate and driven by emotion. ", "3. You are empathetic and like taking care of others. ", "4. You pay attention to your moral compass to determine right from wrong and are less interested in the cold, hard facts.", "5. You consider the effect of your actions on other people", "6. you are concerned with values and what is best for the people involved."], "How do you prefer to plan the work ?": ["1. You prefer being organised and live a planned or orderly way of life. ", "2. You like to be involved in tasks where there is a standard procedure and do not like ambiguity ", "3. You like to take charge of things and take responsibilities and leading roles.", "4. You are self-disciplined and decisive.", "5. You don't procrastinate and complete your work on time. "]}, "Communication Style": "You are a warm, compassionate communicator who shows enthusiasm for other people and their ideas. You want to understand what is important to others so that you can take action to improve the situation for all involved. You readily give affirmation and support, making sure that people know that their ideas are valued. You are good at connecting with a variety of people and creative in coming up with solutions that accommodate others’ needs. You are often a natural teacher and mentor, showing others the way and helping them to improve themselves.", "Values and Motivations": "You are driven by a deep sense of altruism and empathy for other people. You have an intuitive sense of the emotions of others, and often act as an emotional barometer for the people around you. However, your compassion is not reserved for the people close to you: you are often humanitarian in nature, and may feel genuine concern for the ills of the entire human race. You tend to personally experience the feelings of others, and feel compelled to act when they see people suffering.\nYou want close, supportive connections with others, and believe that cooperation is the best way to get things done. You like to be liked and are very sensitive to feedback, both positive and negative. You expect the best not just from yourself, but from others as well, and may find yourself disappointed when others are not as genuine in their intentions as you. You work hard to maintain strong relationships, and strive to be valuable members of your families, groups, and communities.", "Work Place Habits": "At work, you are motivated to organize others to implement positive change. You are an enthusiastic problem-solver, especially when you can put your strong intuition about people to good use.\nYou strive for cooperation and work best in a harmonious environment where You can support other people and encourage their growth. You often take on a mentor role, seeing your primary aim as helping other people become better at what they do.\nYou are often attracted to leadership roles; you naturally organize people to take advantage of their unique talents. You often have a strong vision in your work, and enjoy being able to use your creativity to develop innovative initiatives with a humanitarian focus. You appreciate teamwork and you want to have the organizational resources to put your ideas into action.\nThe ideal work environment for you is forward-thinking and people-centered, with a clear humanitarian mission and an emphasis on constructive action. The ideal job for you allows them to develop and implement ideas that improve the circumstances and well-being of other people.", "How Others Perceive You": "You are a natural teacher, often found organizing people to take part in some educational activity. You tend to take charge of a situation and guide a group towards those activities and experiences which will help them learn and grow. You intuitively see the potential in people, and with charisma and warmth, you encourage others to pursue greater development of their strengths. You are typically dynamic and productive and are often visibly energized when leading others to discover new knowledge.\nYou are typically good communicators, talented at using words to connect with others. You are perceptive about people and enjoy talking about relationships. You often enjoy helping others solve personal problems and like to share your insights about people, your emotions, and your motivations. You are empathetic sometimes to the point of being overinvolved and can become exhausted if you are surrounded by too much negative emotion", "Growth Potential": {"Focus on the details": "Though you read best between the lines, there are times when the nit-picky details really do matter and, in the end, the boring, impersonal contracts just need to be read. This will be a forced response, but a necessary one. In committing to various projects, endeavors or events, you will benefit from a simple “let me think about it” and then actually taking the time to consider the details, objectives and time commitment before responding. ", "Stick to it": "You love starting projects and new endeavors, but sometimes bite off more than they can chew. Rather than looking at the project as a whole and becoming overwhelmed, breaking the work into small pieces and viewing each chunk as a distinct goal can help you maintain enthusiasm and drive. ", "Get comfortable with conflict": "Disunity, divisiveness and conflict are not the end of the world and not something always to be avoided. You do crave amicable rather than adversarial relationships, but growth often happens in the space of tension. When you allow yourself to intentionally confront and deal with conflict, good things—even deepened relationships—may result.  ", "Live in the now": "You are, by nature, future-oriented and while this helps you to visualize potential, it can keep you from dealing with life in the here and now—the possibilities are so much more exciting than the present reality! While you will continue to look to the best the future has to offer, you need to put their scheduling and planning skills into practice to get going on the tasks of today so that you may achieve their future goals. ", "Mind their bottom line": "While you do derive personal satisfaction from being helpful to others, they must be serious about their own talents and the income that should come as a result. It is possible to help people, make a contribution to the world and make a living wage. You may also need to work on becoming more task-oriented and concerned with productivity. It is easy to get caught up in the relational aspects of a project or job and fail to meet the objectives and expectations. You will have to work to keep interpersonal relations and productivity in balance. "}, "Careers to Avoid": ["1. Carpenter", "2. Electrician", "3. Mechanic", "4. Factory Supervisor", "5. Systems Analyst", "6. Medical Records Technician", "7. Auditor", "8. Pathologist", "9. Military\t", "10. Computer Programmer", "11. Engineering Technician", "12. Chemical Engineer", "13. Electrical Engineer", "14. Power Plant Operator"]}, "ENFP": {"Strengths and Weaknesses": {"Strengths": {"Excellent communicators": "You have outstanding communication skills and you know how to use them. You will engage anyone in conversation at the drop of a hat, and you know how to draw others out in a way that keeps the discussion flowing. Whether casually shooting the breeze or collaborating in the workplace, you provide the horsepower that keeps the engine of conversation humming along. ", "Imaginative": "You are an imaginative problem solver and reject the idea that traditional ways are always the best. In every situation, you believe an original approach is possible—and desirable—and you refuse to become prisoners of habit or routine. You see roadblocks as opportunities, and you confront every challenge you face with fresh eyes and no preconceived notions. ", "Natural leaders": "You step forward to assume positions of leadership readily and instinctively. You are confident in their ability to handle demanding responsibilities many people find scary or intimidating. ENFP leaders are consensus builders who work hard to gain the trust of their associates, patiently listening to their ideas and reacting enthusiastically to their good suggestions. Their assertive, “can-do” attitude inspires others and motivates them to action.", "Strong social conscience": "Often active in social movements, you stand up for what you believe in without apology. Some people talk the compassion game but don’t follow through with meaningful action, but you believe it is vitally important to back up caring words with good deeds. Despite their friendly nature, an ENFP will go supernova with righteous anger when you are exposed to suffering and injustice. You can get quite loud and assertive if that’s what it takes to get their opinions heard."}, "Weaknesses": {"Hypersensitivity": "You sometimes let their imaginations run wild and often perceive bad intentions that don’t really exist. Being hyper-alert and aware helps you improve their social comprehension, but reading between the lines only works when something is actually hidden there. If it isn’t, misunderstandings can occur and hurt feelings can damage good relationships.", "Lack of focus and follow-through": "You are endlessly creative, capable of filling a thousand days with a thousand bold ideas. But you don’t always follow through on their inspirations, and if others are not brought on board to handle the details, their best ideas may never be put into practice. You rely on their initial excitement and passion too much and don’t always show the discipline necessary to translate their ideas into real-world production. You have a tendency to start new projects before the last ones are finished, and failing to see things through is where you sometimes come up short. ", "Overthink things": "You have a tendency to perceive slights, resentments or hostility where none actually exist, and your habit of overanalyzing other people’s behaviour can lead to unnecessary anger and conflict. If you aren’t receiving as many compliments as you expect from your significant others, your insecurities can be activated and you may start to feel unappreciated and unloved. ", "Overemotional and approval-seeking. ": "While emotional expression is a core part of you's identity, you can come on too strong. The bubbly, energetic style of you doesn’t mesh well with every partner and introverts, in particular, can sometimes feel steamrolled in their presence. You are also approval-seekers, and in your desire to receive praise and acknowledgement you may try a little too hard to make a good impression, talking too much and listening too little in the process. "}}, "Personality Description": {"Name": "The Victor", "Two Line Description": "You're an enthusiastic being who loves using their communication style  to bring life to a party! ", "Description": "You are people-centred creators with a focus on possibilities and contagious enthusiasm for new ideas, people and activities. Energetic, warm, and passionate, you love to help other people explore their creative potential.\nYou are typically agile and expressive communicators, using their wit, humour, and mastery of language to create engaging stories. Imaginative and original, you often have a strong artistic side. You are drawn to art because of its ability to express inventive ideas and create a deeper understanding of human experience.", "Where do you prefer to focus your energy and attention?": ["1. You are sociable and outgoing. ", "2. You draw your energy from the outside world. ", "3. You talk about your thoughts and feelings and have great communication skills. ", "4. You are adaptable to every situation and are innovative when problems arise. ", "5. You are good at multitasking and prefer to work in a team rather than individually. ", "6. You look for inspiration and ideas from outside sources. "], "How do you grasp and process the information?": ["1. You are imaginative and think out of the box. ", "2. You are innovative, hypothetical and have a futuristic approach towards life. ", "3. You are highly observant and a deep thinker. ", "4. You are aware of yourself and your surroundings. ", "5. You prefer to read between the lines and recognise the connection between random facts ", "6. Ideas inspire you and you are more likely to focus on the theory than the practice of a project."], "How do you make the decisions?": ["1. You decide with heart and dislike conflict. ", "2. You are passionate and driven by emotion. ", "3. You are empathetic and like taking care of others. ", "4. You pay attention to your moral compass to determine right from wrong and are less interested in the cold, hard facts.", "5. You consider the effect of your actions on other people", "6. you are concerned with values and what is best for the people involved."], "How do you prefer to plan the work ?": ["1. You are spontaneous with the given tasks.", "2. You are a Multitasker. ", "3. You don't need a plan or clarity to start work.  ", "4. You want to be independent. ", "5. You dislike structure and are carefree. ", "6. You tend to be flexible and adaptable. ", "7. You always keep your options open."]}, "Communication Style": "You are enthusiastic, collaborative communicators who love exploring possibilities for people. You often enjoy getting to know other people and understanding what inspires them and you are insightful about solutions to personal problems. Highly empathic, you can find something to identify within almost every person you meet and enjoy encouraging other people to develop and grow. You are typically optimistic and like to talk about opportunities for the future, motivating others to join them in your vision.", "Values and Motivations": "You tend to be curious about others and preoccupied with discovering the deeper meaning in people and ideas. You want an authentic experience and often seek emotional intensity. You are easily bored by details and repetition and seek out situations that offer an escape from the mundane. Novelty is attractive to you, who often have a wide range of interests and friends from many backgrounds.\nYou prize individuality and often consider the pursuit of happiness to be the highest priority in life, both for yourself and for others. You place great importance on personal freedom and self-expression and want to be able to go wherever inspiration leads.", "Work Place Habits": "At work, you are concerned with using their creativity to express themselves and benefit others. You want to explore the possibilities for themselves and other people and approach their work with vision and inspiration. You enjoy taking on creative or people-centred problems that call for an imaginative, original solution.\nYou are often motivated by their beliefs in humanitarian causes and want work that is consistent with their values. You are particularly interested in helping other people develop as individuals. You tend to choose careers that allow them to pursue ideals of personal growth and artistic expression.\nYou dislike routine work and want a variety of tasks and challenges. You prefer to set their own schedule and chafe when saddled with excessive regulations or mundane details. You seek out fun, novel tasks that allow them to be imaginative and relate to other people in an unstructured, supportive way.\nThe ideal work environment for you is relaxed and friendly, with few restrictions on creativity. The ideal job for you allows them to follow their inspiration, satisfy their curiosity, and develop solutions that benefit people in innovative and original ways.", "How Others Perceive You": "You love to talk about people: not just the facts, but what motivates them, what inspires them, and what you envision achieving in life. You’ll often share their own aspirations freely, and want to hear others’ in return. You are unlikely to judge anyone’s dream and will discuss the most imaginative and outlandish of fantasies with warm, enthusiastic intensity. You love to explore creative possibilities, and nothing deflates them faster than talking about dry facts or harsh reality.\nYou often seem unconventional, and may come off as scattered; you don’t tend to be in touch with their physical surroundings. You often overlook the details, as you are more likely to focus on connecting with other people or on exploring their own imagination and self-expression. You have little patience for the mundane and want to experience life with intensity and flair. You often have an artistic streak and may be artistic in appearance. Many have developed a distinctive and quirky personal style.", "Growth Potential": {"Accept the fact that if it looks like a duck, swims like a duck and quacks like a duck ... ": "You are intuitive and have a sharp eye for detail. You make a mistake, however, when you insist on looking for hidden motivations or covert agendas everywhere. In normal social encounters, you should make a real effort to give everyone the benefit of the doubt and take words and actions at face value. Assuming the worst can be a self-fulfilling prophecy since people will eventually sense your mistrust and return it in kind. ", "Take the foot off the accelerator": "In social situations, that is. When you are tempted to turn on the charm just a bit more or pick up the intensity in their presentation style, you would be wise to resist those urges. Smiling and nodding and listening are excellent communication tools. Interestingly, because you are so good with words, you actually need fewer of them to make their points or establish solid human connections in most instances. ", "Don’t shirk the “dirty” work": "You don’t always see projects through to the end, preferring to hop from one endeavour to another like a hungry hummingbird flitting through a juicy flower patch. So every once in a while, as a change of pace, you should make it a point to maintain tight control all the way to the finish. Detail work and project management do not always come naturally to you. But you have the insight and know-how to handle all the small stuff if you just make the decision to put their noses to the grindstone and keep them there until the process is complete.", "Look inside for validation": " You enjoy compliments and try very hard to please, and this has a subtle, and not entirely positive, the effect on your behaviour. When you pay too much attention to the opinions of others, it can prevent you from following your own instincts and leave them open to manipulation. “If being true to myself gets me in hot water, then so be it”—that is what you should tell yourself when you start worrying too much about what other people think. ", "Find good partners": "Because you are a little lax with the details, you need assistants and co-workers who can handle the duties you tend to overlook. You enjoy working in teams so it should not be a big stretch to form relationships or partnerships with people whose skills complement their own. In their personal lives, you can also benefit from making connections with those who are good at the aspects of life you neglect. This could certainly be said about any of us, but you have a strong independent streak and may not reach out to others for help as often as you should."}, "Careers to Avoid": ["1. Bank Teller", "2. Financial Manager", "3. Judge", "4. Flight Engineer", "5. Civil Engineer", "6. Mechanical Engineer", "7. Computer Software Engineer", "8. Systems Analyst", "9. Chemical Engineer", "10. Factory Supervisor", "11. Police Officer", "12. Farmer", "13. Dentist", "14. Pathologist", "15. Chemist"]}, "ENTJ": {"Strengths and Weaknesses": {"Strengths": {"Strong-willed": "One thing that is especially admirable about you is your near imperviousness to criticism. Once you have formed a position or made a decision, you don’t buckle under pressure. You are just that certain of the rightness of your beliefs and the deft logic that brought you there. To sway you, people must either outsmart you or prove you wrong. You don’t mind being criticized, don’t take things personally and are not afraid to hold the outside opinion. ", "Efficient": "You are known for your sheer productivity, efficiency and focus, often being able to handle many tasks without dropping or defaulting on any of them. You have limitless energy for your work and they produce more than favourable results. You often obtain what they go after because they are not easily discouraged, even when your plans or positions don’t seem to be working or take longer than expected. You believe they cannot fail. ", "Strategic thinking": "You are sharp thinkers and remarkable problem solvers. They tend to have great ideas and are able to examine the situation from every angle and strategically map out a plan in order to achieve your vision. Rather than being overwhelmed by problems, they are energized by them. These qualities combine with your strong conceptual skills to ensure that every project moves forward with smart, long-term solutions. ", "Charismatic leaders": "You live in a world of possibilities and see challenges everywhere that they gladly attack. They are leaders in the best sense, using your energy and charisma to inspire and motivate others. People often choose you to be their leaders, and this allows you to achieve ambitious plans they could never achieve on their own. "}, "Weaknesses": {"Blunt and dominant": "Given your logical way of thinking, it's no surprise that you are expert at finding flaws and holes. But when combined with your characteristic bluntness and lack of regard for the feelings of others, it can make them appear critical, nitpicky and unrelenting. Not everyone will appreciate having your flaws so frequently picked out and put on display. ", "Intolerant": "You hold others to their same impossible standards, believing everyone can and should work as hard as they do. They often lack patience for people who are naturally less direct or a bit slower. “It’s my way or the highway” can be an intimidating mantra for those on the sharp end of your criticism", "Arrogant": "You respect strategic thinking, quick wits and decisive action, and look down on those who don’t match up. While being sure of yourself can only be a good thing, it often translates to arrogance, especially in the eyes of those who have not put in as much effort and don’t have the same courage in their convictions. ", "Poor handling of emotions": "Empathy is not one of the strengths of the ENTJ. This type tends to be impatient when others refuse or are unable to see things from your perspective, and it requires active attention from you to recognize the value of others' opinions and to take your feelings into account. In a personal environment, you can behave imperiously and trample over others’ feelings, which made not win them any friends. "}}, "Personality Description": {"Name": "The Innovator", "Two Line Description": "You're someone who has got 'an eye for detail' and love coming up with creative solutions to problems. ", "Description": "You are strategic leaders, motivated to organize change. You are quick to see inefficiency and conceptualize new solutions and enjoy developing long-range plans to accomplish their vision. You excel at logical reasoning and are usually articulate and quick-witted.\nYou are analytical and objective and like bringing order to the world around you. When there are flaws in a system, you see them and enjoy the process of discovering and implementing a better way. You are assertive and enjoy taking charge; you see their role as that of leader and manager, organizing people and processes to achieve their goals.", "Where do you prefer to focus your energy and attention?": ["1. You are sociable and outgoing. ", "2. You draw your energy from the outside world. ", "3. You talk about your thoughts and feelings and have great communication skills. ", "4. You are adaptable to every situation and are innovative when problems arise. ", "5. You are good at multitasking and prefer to work in a team rather than individually. ", "6. You look for inspiration and ideas from outside sources. "], "How do you grasp and process the information?": ["1. You are imaginative and think out of the box. ", "2. You are innovative, hypothetical and have a futuristic approach towards life. ", "3. You are highly observant and a deep thinker. ", "4. You are aware of yourself and your surroundings. ", "5. You prefer to read between the lines and recognise the connection between random facts ", "6. Ideas inspire you and you are more likely to focus on the theory than the practice of a project."], "How do you make the decisions?": ["1. You enjoy technical and scientific fields where logic is important.", "2. You look for logical explanations or solutions to everything.", "3. You make decisions rationally. ", "4. You are task-oriented and focused. ", "5. You are ruled by your head instead of your heart.", "6. You are a critical thinker and oriented toward problem-solving."], "How do you prefer to plan the work ?": ["1. You prefer being organised and live a planned or orderly way of life. ", "2. You like to be involved in tasks where there is a standard procedure and do not like ambiguity ", "3. You like to take charge of things and take responsibilities and leading roles.", "4. You are self-disciplined and decisive.", "5. You don't procrastinate and complete your work on time. "]}, "Communication Style": "You are enthusiastic, collaborative communicators who love exploring possibilities for people. You often enjoy getting to know other people and understanding what inspires them and you are insightful about solutions to personal problems. Highly empathic, you can find something to identify within almost every person you meet and enjoy encouraging other people to develop and grow. You are typically optimistic and like to talk about opportunities for the future, motivating others to join them in your vision.", "Values and Motivations": "You are often very motivated by success in their careers and enjoy hard work. You are ambitious and interested in gaining power and influence. To you, decision-making is a vocation. You want to be in a position to make the call and put plans into motion.\nYou tend to be blunt and decisive. Driven to get things done, you can sometimes be critical or brusque in the pursuit of a goal. You are typically friendly and outgoing, although you may not pick up on emotional subtleties in other people. You often love working with others toward a common goal, but may not find time to attend to their feelings. You are focused on results and want to be productive, competent, and influential.", "Work Place Habits": "You are drawn to leadership positions that allow you to develop strategies to achieve greater efficiency and productivity. You prefer to be in management or supervisory roles and want the ability to initiate and lead organizational change.\nYou enjoy the challenge of solving difficult problems and enjoy understanding complex systems so that you can determine where improvement is possible. You naturally see opportunities to improve systems and want to lead teams to carry out your vision. You appreciate an environment where innovation is encouraged, and where traditions are not held sacred.\nYou want structure in your work. You prefer that your work and that of your colleagues be evaluated based on a set of clear guidelines. You appreciate an environment that is businesslike and fair, where performance is evaluated objectively and rewarded generously. You are typically motivated and hardworking and want to be recognized for your efforts with money, power, and prestige.\nAn ideal organization for you values competence and logical thinking and includes coworkers who are intelligent and ambitious. An ideal job for you is one that challenges them to address complex problems with strategic planning and clear goal-setting.", "How Others Perceive You": "You are a natural leader and often take charge no matter where you are. You typically have a clear vision for the future, and intuitively understand how to move people and processes towards that goal. You tend to approach every situation with the attitude of an efficiency analyst and are not shy about pointing out what could be done better. For you, your ideas are a foregone conclusion: it’s just a matter of time before you can move the players to get everything accomplished.\nYou are often gregarious and seem to have an idea for how a person will fit into your grand scheme from the moment they are introduced. You are typically direct and may seem presumptuous or even arrogant; You size people and situations up very quickly and have trouble being anything but honest about what you see. You are sensitive to issues of power, and seek positions and people of influence. You are characteristically ambitious, and often very engaged in your careers. More than any other type, you enjoy your work, and may even say that working is what you do for fun.", "Growth Potential": {"Get in touch with emotions—your own and others’": "you can stand to intentionally work on raising your EQ a few points. Otherwise, you come off as abrasive and unfeeling and your relationships fail to develop properly. You can make progress by working to consider your own feelings and those of other people, but it won’t come naturally. ", "Practice restraint": "Yes, it is important to be right, but this isn’t the only concern. It is important to also consider the personal consequences. Truth and results are important, but you will do well to consider how your actions and decisions will affect the people around them or society at large. ", "Value people": "Ideas, causes and convictions are important, but you will be happier in the long run if you do not completely jettison personal relations and the feelings of others in the quest to be right or to hold to your convictions. And it is possible to enjoy the company and friendship of someone with whom one does not agree on all matters and who also doesn’t desire to argue about it. ", "Listen up": "You must work on listening and not just for the purpose of arguing in return. You, using your combination of intuition and rapid processing, tend to finish sentences, interrupt, anticipate information and make assumptions. You will benefit by slowing down, listening, waiting for others to finish and trying to pay attention to the details—they might actually be important. ", "Relax! ": "The pace you have is rigorous and you often fail to see the need for leisure or rest. But your work schedule, high intensity and perfectionism can cause you to neglect your health and have negative consequences for you and your families. Thus, it is necessary to build leisure, fun, social interaction and rest into your life without feeling guilty about the time you may be spending away from work. And you are likely to find that your work is better for it in the long run. "}, "Careers to Avoid": ["1. Receptionist", "2. Medical Assistant", "3. Teacher's Aide", "4. Restaurant Host", "5. Preschool Teacher\t", "6. Home Health Aide", "7. Medical Records Technician", "8. Dental Assistant", "9. Licensed Practical Nurse", "10. Food Preparation Worker\t", "11. Child Care Provider", "12. Cosmetologist", "13. Craft Artist", "14. Bill Collector", "15. Data Entry Clerk"]}, "ENTP": {"Strengths and Weaknesses": {"Strengths": {"Fearlessness": "One of your greatest strengths and keys to success is your boldness in the face of challenge. These are people who are not afraid to try and fail and try again, perhaps thousands of times; you don’t conceive of it as a failure, merely another step along the path to success. As you invent and innovate, you are undeterred by doubts, you are barely ruffled when outcomes don’t go as planned and you see all “problems” as opportunities to be embraced and pursued. ", "Innovation": "In all things—products, procedures and systems—you know there is always a better way and with the right kind of thinking, you will get there. As a result, you may suffer a lot of seeming failures in your lives but will enjoy many successes as well. You can be marvellously rich and lose your entire life savings—perhaps a few times within the course of your lives. You live out loud and take risks.", "Adaptability": "You are generally go-with-the-flow people. This isn’t to say that you are particularly agreeable individuals, but that you are able to adapt to your circumstances and the problems that arise in life and work. You can improvise on the fly and come up with creative solutions rapidly. You deal well with fast-paced and frequent change and enjoy the corresponding challenges.", "Confidence": "Generally speaking, criticism and ostracism have very little effect on you. You are confident in your skills and talents and believe in the power of your ideas. Opposition on the way to success is to be expected and you don’t take it personally; you’d rather prove your detractors wrong. "}, "Weaknesses": {"Flightiness": "That which is a strength can easily become a weakness and this is seen in the case of you and your idea-generating nature. While this can be your greatest strength, it can also mean that you may be flighty and flaky, jumping from one idea to the next and struggling to follow through. your fear of missing out can make it hard to commit to one idea or one path; you want to keep exploring and evaluating.", "Impracticality": "You have a chaotic air about them that can range from amusing to aggravating, especially to coworkers and spouses. In your tendency to get caught up in your ideas you often lose sight of the immediate tasks around them such as housework, yard work and other responsibilities of daily living, such as paying bills. You may be stunningly brilliant but also poor, disorganized and seemingly untethered.", "Breaking norms": "Nonconformity, while it can be a positive trait, often gets you into trouble. your entire approach to life is founded upon charting your own course, pushing the boundaries and doing things your way. While this leads to great creativity and advances in your fields, it can also put them at odds with authority figures and superiors, which can, in turn, hinder your progress and impede your success. “Incorrigible” and “stubborn” are two words that wouldn’t be out of place in describing you.", "Procrastination": "You are also known for your tendencies toward procrastination and poor time management. To some degree, this is a product of your Perceiving component in which you prefer to continue taking in information rather than making a decision and getting down to business. The issue is not necessarily laziness as much as it is a disinclination to stop the intake of ideas and information to move forward with one idea or one decision. You have a hard time prioritizing tasks and will struggle to keep new information and ideas from getting in the way of the work at hand."}}, "Personality Description": {"Name": "The Insightful", "Two Line Description": "You're one who admires innovators and innovation, and loves bringing new ideas to the table.  ", "Description": "You are inspired by innovators, motivated to find new solutions to intellectually challenging problems. You are curious and clever, and seek to comprehend the people, systems, and principles that surround you. Open-minded and unconventional, Visionaries want to analyze, understand, and influence other people.\nYou enjoy playing with ideas and especially like to banter with others. You use their quick wit and command of language to keep the upper hand with other people, often cheerfully poking fun at their habits and eccentricities. While you enjoy challenging others, in the end, you are usually happy to live and let live. You are rarely judgmental, but you may have little patience for people who can't keep up.", "Where do you prefer to focus your energy and attention?": ["1. You are sociable and outgoing. ", "2. You draw your energy from the outside world. ", "3. You talk about your thoughts and feelings and have great communication skills. ", "4. You are adaptable to every situation and are innovative when problems arise. ", "5. You are good at multitasking and prefer to work in a team rather than individually. ", "6. You look for inspiration and ideas from outside sources. "], "How do you grasp and process the information?": ["1. You are imaginative and think out of the box. ", "2. You are innovative, hypothetical and have a futuristic approach towards life. ", "3. You are highly observant and a deep thinker. ", "4. You are aware of yourself and your surroundings. ", "5. You prefer to read between the lines and recognise the connection between random facts ", "6. Ideas inspire you and you are more likely to focus on the theory than the practice of a project."], "How do you make the decisions?": ["1. You enjoy technical and scientific fields where logic is important.", "2. You look for logical explanations or solutions to everything.", "3. You make decisions rationally. ", "4. You are task-oriented and focused. ", "5. You are ruled by your head instead of your heart.", "6. You are a critical thinker and oriented toward problem-solving."], "How do you prefer to plan the work ?": ["1. You are spontaneous with the given tasks.", "2. You are a Multitasker. ", "3. You don't need a plan or clarity to start work.  ", "4. You want to be independent. ", "5. You dislike structure and are carefree. ", "6. You tend to be flexible and adaptable. ", "7. You always keep your options open."]}, "Communication Style": "You are lively and agile communicators who speak in terms of the “big idea.” You like to explore possibilities and make connections with the information you receive. You love innovative solutions and are enthusiastic about change, but you are also highly analytical and will not hesitate to criticize ideas that don’t hold up to your logical analysis. You can be hard to keep up with in conversation; you like to play with lots of complex ideas and have little patience for explaining details.", "Values and Motivations": "You are energized by the challenge and are often inspired by a problem that others perceive as impossible to solve. You are confident in their ability to think creatively, and may assume that others are too tied to tradition to see a new way. The Visionary relies on their ingenuity to deal with the world around you, and rarely finds preparation necessary. You will often jump into a new situation and trust yourself to adapt as you go.\nYou are masters of re-inventing the wheel and often refuse to do a task the same way twice. You question norms and often ignore them altogether. Established procedures are uninspiring to the Visionary, who would much rather try a new method (or two) than go along with the standard.", "Work Place Habits": "At work, you are concerned with applying innovative solutions to challenging problems to improve the efficiency and effectiveness of systems. You often take an entrepreneurial approach to your work and you prefer to approach tasks in a casual and unstructured way, with few limitations on your ingenuity.\nYou prize competency and often want to be the expert. You enjoy work that demands continual improvement in your knowledge and skills. You value power and want a career that allows them to contact powerful people and the opportunity to increase your influence.\nYou are an ideal person and chafe at routine. You get bored very quickly when required to repeat a task or attend to details. You do best when your work is highly conceptual and allows them to solve problems creatively without having to think through the details.\nThe ideal work environment for you is intellectually challenging without being rigid, with creative and intelligent coworkers. The ideal job for you allows them to put your creativity to work developing innovative ideas while allowing them to delegate responsibility for the tedious details of implementation to others.", "How Others Perceive You": "You are typically friendly and often charming. You usually want to be seen as clever and may try to impress others with your quick wit and incisive humour. You are curious about the world around them and want to know how things work. However, for you, the rules of the universe are made to be broken. You like to find the loopholes and figure out how you can work the system to your advantage. This is not to say the Visionary is malicious: you simply find rules limiting, and believe there is probably a better, faster, or more interesting way to do things that haven’t been thought of before.\nYou are characteristically entrepreneurial and may be quick to share a new business idea or invention. You are confident and creative, and typically excited to discuss your many ingenious ideas. Your enthusiasm for innovation is infectious, and you are often good at getting other people on board with your schemes. However, you are fundamentally “big-picture” people and maybe at a loss when it comes to recalling or describing details. you are typically more excited about exploring a concept than you are about making it a reality, and can seem unreliable if you don’t follow through with your many ideas.", "Growth Potential": {"Do a little more research": "You are quick to dive into new projects and ideas headfirst. While this enthusiastic “all in” quality can be a strength, it can also be detrimental when people of this type fail to do the due diligence or to pay adequate attention to the details. You can help avoid wasted time and money by stepping back and investigating first. ", "Look at the “small picture.” ": "As big-picture people and conceptual thinkers, people of this type are focused on the broad themes and patterns and the big, important projects, often letting the details fall by the wayside. However details—while nothing more than a bother to you—are often essential. You will do well to realize that details often end up eating more time in the long run if neglected or overlooked.", "Learn to adapt to rules and structures": "Rules aren’t actually made to be broken, contrary to your belief, and the people who follow them aren’t to be disdained as thoughtless or unintelligent. These boundaries provide order. If everyone disregarded them we’d be living in very different circumstances. You will get along better at work and in society if you can try to have a little respect for authority and follow the rules.", "Stick to it": "You generate so many different ideas and interesting options that you simply want to explore them all. While this can be an asset, it also can deter them from simply getting on with the work at hand. At some point, in order to be most productive, you need to make a decision on a course of action, plot the steps to the finish and then just get going.", "Differentiate between the possible and the probable": "You often don’t properly distinguish between these two categories and thus find yourself spending a wealth of resources pursuing something that, though possible, is not at all probable. People of this type will do well to factor in the feasibility of various ideas when considering your many options. "}, "Careers to Avoid": ["1. Medical Records Technician", "2. Dentist", "3. Nurse's Aide", "4. Optometrist", "5. Family Physician", "6. Medical Assistant", "7. Dietitian", "8. Preschool Teacher", "9. Elementary Teacher", "10. Clergy", "11. Library Assistant", "12. Recreation Worker", "13. Receptionist", "14. Factory Supervisor", "15. Administrative Assistant", "16. Bank Teller", "17. Machinist", "18. Airline Pilot"]}, "ESFJ": {"Strengths and Weaknesses": {"Strengths": {"Strong practical skills": "Good intentions are wonderful, but they don’t mean much unless they’re backed up by a well- organized plan of action. You understand how to accomplish tasks better than most, and that is why the to-do lists you make are seldom left with any unchecked items. you are so conscientious and detail-oriented you can’t stomach the thought of leaving an important job or project only half-finished, and you would feel embarrassed if you gave anything less than your very best effort in each and every instance.", "Warm and sensitive": "With grand and gentle hearts, you form lasting emotional bonds and make strong empathic connections with others. When someone needs guidance, you will be by their side, supporting them with advice that is concrete, sensible and guaranteed to produce good results. No problem is too big or too small to arouse the interest of you, and regardless of what a friend, loved one or acquaintance is going through, you will do your best to provide impactful assistance. ", "Loyal and dutiful": "You are a traditionalist right down to the core. You are concerned with protecting the best parts of the existing social order against the forces of “progress”, and always honour the wisdom of your elders, always put the interests of others before your own. Doing the right thing every time doesn’t make life easy, but you are incapable of following the path of least resistance when people need help or moral issues are involved. ", "Stand up and be counted": "You aren’t intimidated by challenges and you aren’t willing to just sit by and wait for others to take the lead. Inside your social and community circles, you are always willing to step up and lend a helping hand; in support of great causes you will organize, volunteer, recruit, fundraise, run for election, put up flyers, go door-to-door or give speeches on street corners— sometimes all in the same week! "}, "Weaknesses": {"Rigid and judgmental": "While you are tolerant in general, you don’t approach the world with a completely open mind. Your value systems are defined by fixed ideas about right and wrong, good and bad, smart and foolish, and you tend to categorize everything you see according to such dualistic concepts. “Live and let live” is not a concept that appeals to you, who are not shy about judging the behaviour and character of others based on brief initial impressions. ", "Reluctant to improvise": "You have a lot of respect for rules, laws, regulations and traditional codes of conduct—a world without shoulds and shouldn’t and dos and don’ts would be unsustainable and chaotic to the traditionalist you. But in some instances, outside the box thinking may be required. You can be slow to recognize this reality, making you rigid and unyielding when a bit more openness to change is called for. ", "Neediness": "You have a strong need to be noticed, acknowledged and appreciated, and you want others to see you as helpful, trustworthy and virtuous. This means that your sense of self-worth will rise or fall based on the amount of praise or criticism you get from others. You aren’t worried about what other people will think every minute of the day, but you do take rejection very personally and have a hard time getting over any perceived slight. ", "Lack of creative thinking": "Too often, you are so focused on the here and now you miss opportunities for growth and improvement that are staring you right in the face. A long view that embraces creative inspirations, abstract ideas and big picture thinking can allow you to reach new levels of understanding, but taking your intellects in this direction does not come naturally to you. A failure to respect the benefits of the creative power of the imagination can keep you stuck in patterns of thought and behaviour that have long outlived your usefulness."}}, "Personality Description": {"Name": "The Contributor", "Two Line Description": "You're diligent and empathetic who admires obedience and gives importance to your loved ones.", "Description": "You are conscientious helpers, sensitive to the needs of others and energetically dedicated to their responsibilities. You are highly attuned to their emotional environment and attentive to both the feelings of others and the perception others have of you. You like a sense of harmony and cooperation around You, and are eager to please and provide.\nYou value loyalty and tradition, and usually make their family and friends their top priority. You are generous with their time, effort, and emotions. You often take on the concerns of others as if they were their own, and will attempt to put their significant organizational talents to use to bring order to other people's lives.", "Where do you prefer to focus your energy and attention?": ["1. You are sociable and outgoing. ", "2. You draw your energy from the outside world. ", "3. You talk about your thoughts and feelings and have great communication skills. ", "4. You are adaptable to every situation and are innovative when problems arise. ", "5. You are good at multitasking and prefer to work in a team rather than individually. ", "6. You look for inspiration and ideas from outside sources. "], "How do you grasp and process the information?": ["1. You are observant. ", "2. Your decisions depend on facts and figures. ", "3. You are rational and realistic. ", "4. You focus on the present and have a reasonable approach. ", "5. You use experience and common sense to solve problems.", "6. You apply all your senses. "], "How do you make the decisions?": ["1. You decide with heart and dislike conflict. ", "2. You are passionate and driven by emotion. ", "3. You are empathetic and like taking care of others. ", "4. You pay attention to your moral compass to determine right from wrong and are less interested in the cold, hard facts.", "5. You consider the effect of your actions on other people", "6. you are concerned with values and what is best for the people involved."], "How do you prefer to plan the work ?": ["1. You prefer being organised and live a planned or orderly way of life. ", "2. You like to be involved in tasks where there is a standard procedure and do not like ambiguity ", "3. You like to take charge of things and take responsibilities and leading roles.", "4. You are self-disciplined and decisive.", "5. You don't procrastinate and complete your work on time. "]}, "Communication Style": "You are an enthusiastic and caring communicator, who wants to engage people to contribute and accomplish what needs to be done. You tend to be friendly and to get along easily with others, although you can become frustrated with those who do not respond to your attempts to reach out. You have a good memory for detail, especially facts about other people, and enjoy getting to know people and understanding your needs. You are factual in your communication, but generally uncomfortable with criticism and conflict, preferring instead to provide support and encouragement to others.", "Values and Motivations": "You act according to a strict moral code and look for others to do the same. You often see things in terms of black and white, right and wrong, and you are typically not shy about sharing their evaluations of others' behaviour. You seek harmony and cooperation and feel this is best accomplished when everyone follows the same set of rules. You have a sense of order in the way people relate to one another, and often take on roles that allow you to help enforce that social order.\nYou feel a sense of personal responsibility for other people's needs and are usually eager to get involved and help out. You tend to be serious and practical, dutifully putting business before pleasure—especially the business of caring for others. You typically enjoy routine and often keep a regular schedule that allows you to be organized and productive.", "Work Place Habits": "You like to put your interpersonal skills to work to organize people and processes. You are tuned into the needs of others and seek to create a structure to provide for people. You often prefer work that allows you to help people in practical, observable ways.\nYou enjoy work that allows you to follow through and see results and prefer a high degree of structure and organization. You gain satisfaction from completing tasks with attention to order and detail. An ideal job for you requires attention to procedure and specifications and allows you to work methodically to organize people and processes.\nYou usually prefer to work with others and are energized by participating in a motivated, conscientious, action-oriented team. It is important for you to do work that is accordant with your values, as well as to work with others who are supportive and cooperative. An ideal work environment for you provides clear expectations and a friendly, structured atmosphere free from conflict or uncertainty.", "How Others Perceive You": "You may often be found playing host or hostess. you tend to take on the role of organizer without hesitation, and want to be sure that everyone is taken care of. Roles such as committee leader, event planner, and church volunteer suit you well. You are typically engaged with your communities and work hard to do your part in maintaining the social order. You are interested in other people and like to know the details of your lives. Gossip is a favourite pastime of many you; you love to share stories about the people around you.\nYou have a clear moral code that guides your behaviour and your expectations from others. you often have strong opinions about how people should behave and the proper thing to do. Manners and other codes of social interaction are often of great interest to you. You may think in terms of black and white, right and wrong. You can be judgmental of others who you do not think are acting appropriately, but you have the best of intentions: you simply want everyone to follow the rules so you can all get along. You want things to be all right with the people around you and may become very involved with others’ problems and concerns.", "Growth Potential": {"Get some emotional separation": "Helping others gives you enormous satisfaction but, like sponges, you absorb the anxieties of others as if those troubles were your own. Unfortunately, this is emotionally exhausting and can put a huge strain on you who may become so preoccupied with the suffering and angst of your loved ones that you lose sight of your own personal needs. In the long run, you would be more effective if you could learn to put some emotional distance between yourself and the people you choose to assist. ", "Practice “letting go”. ": "Fish are going to swim, birds are going to fly, and you are going to make judgments about people and events based on your own exacting standards. But just because you possess this trait doesn’t mean you have to indulge it in every single instance. If you can learn to detach just a bit from your initial impressions, you will have a much easier time altering your judgments as more information comes in.", "Remember that no one can please all of the people all of the time": "You crave the favourable opinions of others and you always go the extra mile to please. But trying to satisfy everyone in every circumstance is impossible, no matter how friendly or accommodating you might be. The sooner you realize this the better off you will be. Like anything else, it takes practice to change attitudes, but learning to accept occasional rejection can help you find greater harmony and peace of mind. ", "Practice solo hobbies": "You can become overly dependent on other people, to the point where you feel ill-at-ease if there is no one around to talk to. We all need some alone time where we can reflect in peace and silence. Solitary hobbies and activities that require quiet concentration and promote self-reliance are highly recommended for you, who need to get in touch with your feelings and figure out how to get by without constant outside feedback. ", "Learn a little more about how rules, laws, regulations and traditions actually came into being": "You obey the rules and respect traditional ways. But rather than just accepting them without question, you should consider studying up to understand where they actually came from. Ideas we take for granted now were fresh and innovative at some point in the past, and you often represented a clean break from previous assumptions. Discovering where “self-evident truths” and “common sense” really came from can help you broaden your perspective. And if this makes you a little more open to new ideas in the present, it will be a positive development all the way around. "}, "Careers to Avoid": ["1. Software Developer", "2. Computer Programmer", "3. Power Plant Operator", "4. Tech Support Specialist", "5. Farmer", "6. Airline Pilot", "7. Investment Banker", "8. Attorney", "9. Auditor", "10. Actor", "11. Editor", "12. Recreation Worker", "13. Electrician", "14. Mechanical Engineer", "15. Electrical Engineer", "16. Chemist", "17. Social Scientist", "18. Economist"]}, "ESFP": {"Strengths and Weaknesses": {"Strengths": {"Showmanship": "You have lively personalities which you use to liven up every room you occupy. Bringing smiles and enjoyment to others gives you greater satisfaction than anything else in the world. Being cheerful, entertaining and humorous comes naturally to you, and the people who know you best realize your interest in the happiness of others is sincere and motivated by empathetic and compassionate instincts.", "Supportive": "You do like to be the centre of attention, but you also prize the spirit of cooperation and never try to hog the spotlight when asked to work on group projects. It is really the social give-and-take that you enjoy the most, and if you act as facilitators in cooperative situations it is only because your outgoing natures predispose them to take the lead. As teammates or partners, you will always listen to what everyone has to say, will never try to force your ideas on anyone. ", "Positivity": "You are the quintessential positive thinkers, firmly believing the bright side is the only one worth looking at. You see every minute of wasted time as a lost opportunity, and you can’t stand to throw away chances for fun, conversation, excitement or unique experience. Furthermore, you do a fantastic job of passing on your enthusiasm and hopefulness to your companions, and that is why some of the most admired self-help gurus and motivational speakers come from your ranks. ", "Bold and practical": "Because you refuse to live in the past or the future or get distracted by dreams or fantasies about the way the world should be, you are high-quality practical workers who never sacrifice your determination to accomplish remarkable things in the present moment. You want desperately to help others, but you also want to see results from your efforts immediately and aren’t willing to be patient. You will put the pedal to the metal in a heartbeat if you see opportunities to make a constructive impact in the lives of the people you care about most. "}, "Weaknesses": {"Avoid conflict": "The one problem with “glass half full” types is that you will sometimes deny unpleasant truths or avoid uncomfortable situations if you feel it might cast a dark cloud. You hate buzzkills, and this makes them a bit squeamish about conflict, persistent social problems and a variety of other unfortunate circumstances that can’t be wished away or overcome with a cheerful attitude.  ", "Sensitive": "It is ironic given your tendency to showmanship and outspokenness, but you are extremely sensitive and can be deeply hurt when others criticize your ideas, personalities or conduct. You have a tough time seeing such criticism as constructive, and you usually react with anger and resentment when you feel someone is questioning or attacking them. ", "Easily bored": "With a need for constant excitement, you find it hard to maintain your focus on the topic at hand; often demonstrating the sort of attention span normally seen only in kindergarten classrooms. This can make you appear flighty and unfocused. Life is not a non-stop party, and you do need to knuckle down if you are to turn your high energy into an accomplished goal. ", "Poor long-term focus": "When given the choice between theory and proven practice, you will choose the latter every time. You distrust abstract concepts, future hypotheses and big picture projections and this makes you poor long-term planners. You aren’t as good at recognizing alternatives as you should be, and this can blind them to exciting possibilities for growth, evolution and constructive change. "}}, "Personality Description": {"Name": "The Artist", "Two Line Description": "You're someone who appreciates the little things in life and are typically warm and enthusiastic.", "Description": "You are vivacious entertainers who charm and engage those around you. You are spontaneous, energetic, and fun-loving, and take pleasure in the things around you: food, clothes, nature, animals, and especially people.\nYou are typically warm and talkative and have a contagious enthusiasm for life. You like to be in the middle of the action and the centre of attention. You have a playful, open sense of humour, and like to draw out other people and help them have a good time.", "Where do you prefer to focus your energy and attention?": ["1. You are sociable and outgoing. ", "2. You draw your energy from the outside world. ", "3. You talk about your thoughts and feelings and have great communication skills. ", "4. You are adaptable to every situation and are innovative when problems arise. ", "5. You are good at multitasking and prefer to work in a team rather than individually. ", "6. You look for inspiration and ideas from outside sources. "], "How do you grasp and process the information?": ["1. You are observant. ", "2. Your decisions depend on facts and figures. ", "3. You are rational and realistic. ", "4. You focus on the present and have a reasonable approach. ", "5. You use experience and common sense to solve problems.", "6. You apply all your senses. "], "How do you make the decisions?": ["1. You decide with heart and dislike conflict. ", "2. You are passionate and driven by emotion. ", "3. You are empathetic and like taking care of others. ", "4. You pay attention to your moral compass to determine right from wrong and are less interested in the cold, hard facts.", "5. You consider the effect of your actions on other people", "6. you are concerned with values and what is best for the people involved."], "How do you prefer to plan the work ?": ["1. You are spontaneous with the given tasks.", "2. You are a Multitasker. ", "3. You don't need a plan or clarity to start work.  ", "4. You want to be independent. ", "5. You dislike structure and are carefree. ", "6. You tend to be flexible and adaptable. ", "7. You always keep your options open."]}, "Communication Style": "You are an enthusiastic and caring communicator, who wants to engage people to contribute and accomplish what needs to be done. You tend to be friendly and to get along easily with others, although you can become frustrated with those who do not respond to your attempts to reach out. You have a good memory for detail, especially facts about other people, and enjoy getting to know people and understanding your needs. You are factual in your communication, but generally uncomfortable with criticism and conflict, preferring instead to provide support and encouragement to others.", "Values and Motivations": "You live in the moment, enjoying what life has to offer. You are especially tuned in to their senses and take pleasure in the sights, sounds, smells, and textures around you. You like to keep busy, filling their lives with hobbies, sports, activities, and friends. Because you'd rather live spontaneously than plan ahead, you can become overextended when there are too many exciting things to do. And you hate nothing more than missing out on the fun.\nAlthough you are characteristically fun-loving, you are also typically practical and down-to-earth. You are grounded in reality and are usually keenly aware of the facts and details in their environment, especially as you pertain to people. You are observant of others and their needs and responsive in offering assistance. You enjoy helping other people, especially in practical, tangible ways.", "Work Place Habits": "At work, you want to be hands-on and in the middle of the action. You prefer an active, social work environment where you are free to be spontaneous and have fun, with co-workers who are friendly, laid-back, and enthusiastic.\nYou are pragmatic, realistic, and tuned into the needs of others. You often choose a job that allows them to be of service to people, and where you can see real, tangible results for your efforts. You are talented at solving practical, people-centred problems, and can put this skill to good use in assisting others.\nYou are keenly tuned in to your senses and often have an artistic streak. You may choose careers that engage your sensual nature through food, textiles, art, or music. You often want a career that allows them to move around, and generally prefer a work environment that is aesthetically pleasing.\nYou are stressed by strict rules or excessive bureaucracy at work and want the flexibility to address situations as they arise. You generally focus on the demands of the present moment and do not usually like to work on long-term projects, preferring work that has immediate and tangible results.", "How Others Perceive You": "You are often the life of the party, entertaining and engaging others with humour and enthusiasm. You notice whether other people are having fun, and do your best to create a good time for all. Typically at home in your physical environment, you may take the lead in getting everyone involved in some active diversion. You are generally friendly and likeable, but can be hard to get close to; although you tend to be very open, you are reluctant to be serious or to talk about anything negative.\nYou are tuned into your senses and often gravitate towards pleasing colours and textures in your environments. You often carefully choose fabrics and decorations with which to surround themselves. This attention also often translates into your appearance; you are often dressed in sensuous fabrics or bright, dazzling colours. You are often up on the latest trends and like to excite the people around you with new environments and experiences.", "Growth Potential": {"Make lists and write down goals": "Too often, the spontaneity and impulsivity of you lead you astray. To avoid spur-of-the-moment decision making, you should try to set goals and organize your activities ahead of time, possibly with the assistance of written lists and schedules. This would give them a clear life plan to refer back to, keeping them on the straight and narrow when faced with temptation. ", "Don’t ignore the long-term consequences": "By focusing on practical matters so intently, you sometimes waste chances to improve your lives and establish long-term goals. We all need to broaden our horizons and step back so we can see things from a greater perspective. You would benefit from undertaking a meaningful dialogue with the dreamers, creators and visionaries in your lives. The more relationships you can form with big picture thinkers the better off you will be. ", "Assume it’s all constructive criticism. ": "You are sensitive to criticism of all types. You take it personally and often react with resentment and defensiveness. This is not an easy personality trait to subdue but, with practice, you can reprogram your thinking patterns, becoming less reactive and more open-minded over time. As a starting point, you should attempt to convince yourself that all the criticism you receive is meant to be constructive—which it might very well be. If you can reach this point, your personal growth is all but ensured. ", "Investigate alternative learning strategies": "You often have a hard time functioning in formal academic environments, where it is impossible to escape from the abstract and the theoretical. You prefer practical, hands-on learning that will help them develop specific skills that can be applied in real-world situations.  Fortunately, there are alternative learning environments that can provide a you-friendly learning experience—internships, apprenticeships, trade schools or technical colleges, individualized study programs at online universities. You could benefit tremendously if you ventured away from the traditional educational model and forged your own path. ", "Shine a flashlight into the darkest corners": "You are notorious for avoiding unpleasant topics or situations. But running from trouble actually empowers it, allowing it to ruin relationships if tensions are left unaddressed. Instead of avoiding things that make you uncomfortable, you would be better off to confront them, before you have the chance to do any real damage. A positive attitude should not be used as an excuse for denial, which is always a bad idea no matter the circumstances. "}, "Careers to Avoid": ["1. Systems Analyst", "2. Tech Support Specialist", "3. Airline Pilot", "4. Mechanical Engineer", "5. Chemical Engineer", "6. Biomedical Engineer", "7. Psychiatrist", "8. School Administrator", "9. English Teacher", "10. Family Physician", "11. Psychologist", "12. College Professor", "13. Attorney", "14. Judge", "15. Management Consultant", "16. Auditor", "17. Accountant", "18. Economist"]}, "ESTJ": {"Strengths and Weaknesses": {"Strengths": {"Organization and efficiency. ": "You are planners and list makers—orderly and scheduled. Your brain naturally imposes structure on your lives and on your time. You enjoy creating order out of chaos and are always punctual. This contributes to the perception others have of you as reliable, dependable and steady. ", "Dedication and commitment": "No one could accuse you of shirking, and it’s natural for this type to give 110 per cent in all areas of life and exhibit boundless energy as you do. You’d sooner sacrifice your personal time or preferences than renege on a commitment or fail to submit your best work. Employers can count on you to uphold the vision of the organization at all times, to work at full speed and to encourage others to do the same. ", "Integrity": "You demonstrate consistent integrity in roles of leadership, believing the rules apply as much to you as your subordinates. And though you skillfully exercise authority, you also show great respect for your own superiors and don’t struggle to follow orders. You see that organizations and societies function best when there is a healthy sense of respect and duty. ", "Stewardship": "You are the gatekeeper of society. You are like people who feel personally responsible for upholding the standard and formulating a very clear picture of what passes and what doesn’t. As such, you can always be counted on to uphold the laws, rules, regulations and ordinances that keep society structured and functioning smoothly. On the home front, you are committed to your families and desire to provide well for anyone you consider to be under your care. "}, "Weaknesses": {"Judgmental": "A black-and-white approach to life can be a significant pitfall for you. While you are commendably committed to your beliefs, you often forget that all of the principles you espouse are neither universal nor objective, and the traditional, time-honoured way isn’t the only way. You may fail to see that innovation can be beneficial and can be impatient with people who choose non-conventional lifestyles, coming across as judgmental or narrow-minded as a result. ", "Uncomfortable with emotions": "You often fail to value emotions or take feelings into account—your own and others’—and this can make you appear harsh, abrasive, utilitarian and uncaring. Your typically low EQ may lead you to misjudge the intentions of others and to be equally misunderstood. You often have little patience for people who think or act intuitively or who react emotionally, seeing these as liabilities rather than potential strengths. ", "Workaholism": "While your work ethic is to be commended, people of this type can also err on the side of workaholism and perfectionism. Your Type A personality and intensity can be a little hard for others to take, as you are often quite unsympathetic to those who may not work as hard or as “perfectly” as you do. ", "Stubborn and inflexible": "You are committed to your own way or perspective as objectively right, and this can impede the process of personal growth. In fact, you are often so firmly planted in your original belief, as well as your own rightness, that you fail to acknowledge new or conflicting information that would lead to an altered and perhaps truer conclusion. The rigidity can keep you from being truly open-minded and your practical approach to thinking and life, in general, may stifle your ability to think imaginatively or to exercise vision."}}, "Personality Description": {"Name": "The Manager", "Two Line Description": "You possess an industrialistic outlook on life and love working on projects systematically without being lazy or laid back.", "Description": "You are hardworking traditionalists, eager to take charge in organizing projects and people. Orderly, rule-abiding, and conscientious, you like to get things done, and tend to go about projects in a systematic, methodical way.\nYou are the consummate organizers and want to bring structure to their surroundings. You value predictability and prefer things to proceed in a logical order. When you see a lack of organization, you often take the initiative to establish processes and guidelines, so that everyone knows what's expected", "Where do you prefer to focus your energy and attention?": ["1. You are sociable and outgoing. ", "2. You draw your energy from the outside world. ", "3. You talk about your thoughts and feelings and have great communication skills. ", "4. You are adaptable to every situation and are innovative when problems arise. ", "5. You are good at multitasking and prefer to work in a team rather than individually. ", "6. You look for inspiration and ideas from outside sources. "], "How do you grasp and process the information?": ["1. You are observant. ", "2. Your decisions depend on facts and figures. ", "3. You are rational and realistic. ", "4. You focus on the present and have a reasonable approach. ", "5. You use experience and common sense to solve problems.", "6. You apply all your senses. "], "How do you make the decisions?": ["1. You enjoy technical and scientific fields where logic is important.", "2. You look for logical explanations or solutions to everything.", "3. You make decisions rationally. ", "4. You are task-oriented and focused. ", "5. You are ruled by your head instead of your heart.", "6. You are a critical thinker and oriented toward problem-solving."], "How do you prefer to plan the work ?": ["1. You prefer being organised and live a planned or orderly way of life. ", "2. You like to be involved in tasks where there is a standard procedure and do not like ambiguity ", "3. You like to take charge of things and take responsibilities and leading roles.", "4. You are self-disciplined and decisive.", "5. You don't procrastinate and complete your work on time. "]}, "Communication Style": "You are a practical, action-oriented communicator. You often assume control and communicate to organize and determine what needs to be done. You are clear about expectations and procedures; you explain the necessary steps as well as how and when tasks should be completed. You are open to debate and criticism, but want rules to be followed and work to get done. You are focused on tasks and results and have little patience for deviation or nonconformity.", "Values and Motivations": "You are conventional, factual, and grounded in reality. For you, the proof is in the past: what has worked and what has been done before. You value evidence over conjecture and trust their personal experience. You look for rules to follow and standards to meet and often take a leadership role in helping other people meet expectations as well. You concern yourself with maintaining the social order and keeping others in the line.\nYou often take on a project manager role at home as well as at work, and excel at setting goals, making decisions, and organizing resources to accomplish a task. You want to achieve efficient productivity and typically believe this is best accomplished when people and systems are well organized.", "Work Place Habits": "At work, you excel at organizing—people, projects, and operations. You like to be in control and often seek out management positions, preferring to be in a role where you can make decisions and enforce policies and procedures.\nYou quickly develop a reputation in the workplace as people who can be trusted to deliver, on time and as requested. You are unfailingly reliable and gain satisfaction from bringing a project to completion. Because of your eagerness to take on responsibility, you sometimes become overworked.\nThe ideal work environment for you is highly structured, with a clear set of expectations and an organized authority structure. The ideal job for you allows you to use your organizational skills within a set of standardized procedures to efficiently produce a tangible product.", "How Others Perceive You": "You command a situation, with the sense that you know how things should go and are ready to take charge to make sure that it happens. You are task-oriented and put work before play. Confident and tough-minded, you appears almost always to be in control. You appreciate structure and often begin to organize as soon as you enter a room. You want to establish the ground rules and make sure everyone does what they’re supposed to.\nYou are often involved in institutions: clubs, associations, societies, and churches, where you usually take a leadership role. You typically connect with others through sharing ritual and routine. Social interaction for you often means following an established tradition to engage with others in a structured way. You tend to respect and seek out the hierarchy. You want to know who’s in charge and will assign levels of responsibility if none exist. Once a structure is in place, you typically trust authority figures and expect obedience from people of lower rank.", "Growth Potential": {"Withhold judgment": "You may be quite sure you have the motive, intent, outcome and conclusion figured out before you’ve received even a fraction of the details, and fail to acknowledge that he or she may not have the whole story. You will do well to hold off a bit before delivering a snap judgment or assessment. Focus on asking more questions, waiting for more details and acknowledging that as certain as you are, there may be things you are not seeing. ", "Live and let live": "You often don’t realize that your way isn’t the only way and that other personalities have much to contribute and should not be dismissed. The you that can bend a little might find that flexibility and openness isn’t such a bad thing. There is really no need to be stubborn just for the sake of it. ", "Be more self-critical": "You have a tendency to think you are always right and that your moral compass is objective, absolute and universal. But your objectivity isn’t always objective as it appears—you have a standard that feels objective to you, often due to “how it’s always been done.” You would benefit from realizing that personal objectivity is, by definition, somewhat subjective, and spending some time examining the bases of your beliefs.", "Get in touch with your feelings": "You need to work on acknowledging your own feelings and being a little more careful with the feelings of others. While it may seem that it’s “not personal,” it may be to a subordinate or a child. Harshness and rigidity can drive away good employees and estrange family members, so make a point to recognize the gifts and talents of others and to be intentional in showing appreciation for these talents. ", "Take it easy": "You need to work on stress relief and intentionally taking it easy. While you don’t want to be seen as lazy, it helps to remember that leisure and rest are not signs of sloth, but normal ways in which humans recharge. You benefit from taking vacations that really are vacations (not endless activity, planning and tourism) and to practice forced rest. Practices such as yoga, tai chi and meditation can help. "}, "Careers to Avoid": ["1. Artist", "2. Graphic Designer", "3. Writer", "4. Musician", "5. Actor", "6. Art Director", "7. Cosmetologist", "8. Restaurant Host", "9. Recreation Worker", "10. Preschool Teacher", "11. Social Scientist", "12. Physical Therapist", "13. Child Care Provider", "14. Social Worker", "15. Nurse's Aide", "16. Veterinary Assistant", "17. Psychologist", "18. Librarian", ""]}, "ESTP": {"Strengths and Weaknesses": {"Strengths": {"Can-do attitude": "No one will ever call you lazy or uncertain, and this very self-assured, can-do approach to life and work is certainly a strength. People of this type spend more time acting than thinking, and while this may seem potentially unwise and hasty, you actually process information very rapidly and have a knack for improvising as you go. This makes you excellent in emergency situations as you think on the fly and respond reflexively. ", "Bold": "You also abound in mental toughness and sense of competition that makes you relentless in pursuing what you are after. You respond well to your physical environment and know how to manoeuvre your world. You are efficient, clever, bold and driven. And as a result, you often get what you are after and aren’t afraid to take a few risks to get there. ", "Personable and sociable": "You are people-focused and get along well with just about anyone. You are observant and perceptive, and you read people well. This has the benefit of helping others to feel that you are cared about because you pays attention and responds appropriately. Though you may not always pick up on or prioritize emotional cues, you are quick to notice and respond to tangible needs.", "Direct": "You are efficient, a matter of fact, direct and to the point. You don’t mince words or want to spend a lot of time hemming and hawing. Many people appreciate your honesty and even your bluntness; you always know where they stand with you. You aren’t afraid to call it as you see it. "}, "Weaknesses": {"Judgmental": "While your powers of perception and observation are often seen as strengths, it may also mean you are quick to prejudge situations and people and to categorize them based upon initial perceptions. The downfall of this is that you potentially sacrifice many opportunities for profitable or enjoyable relationships or experiences simply on the basis of initial outward appearances. ", "Impatient": "Because you are quick thinkers and doers, you easily become impatient with those who process at a slower pace than you do, who lack your capacity for common sense or street smarts or who tend to be more sensitive or emotional. You feel the emotional concerns of others to be an unnecessary drain on your energy and may resent them. You will also be reluctant to afford weight to intuition or feelings-based arguments.", "Unstructured": "People of this type tend to live in a state of urgency and emergency because you do very little advance planning. Though you may be comfortable with this pattern of living, it breeds chaos for everyone around you and can impede your professional and personal relationships. The crux of the issue is that you are often unstructured and undisciplined, exercising poor time management skills and taking on far more than you can handle; often because you have a hard time saying no or you refuse to admit you can’t fit it all in. ", "Commitment phobic": "You hate to be bored and want life to always be new, stimulating and interesting. The reality, however, is that life is often not interesting or novel and relationships can get a little dull at certain points. You often lack the patience and the drive to stick it out through the low points."}}, "Personality Description": {"Name": "The Go-Getter", "Two Line Description": "You inherit qualities of being lively and observant both at the same time. You're adept at conflict handling as well. ", "Description": "You are energetic thrillseekers who are at their best when putting out fires, whether literal or metaphorical. You bring a sense of dynamic energy to their interactions with others and the world around you. You assess situations quickly and move adeptly to respond to immediate problems with practical solutions.\nActive and playful, You are often the life of the party and have a good sense of humour. you use their keen powers of observation to assess their audience and adapt quickly to keep interactions exciting. Although You typically appear very social, You are rarely sensitive; You prefer to keep things fast-paced and silly rather than emotional or serious.", "Where do you prefer to focus your energy and attention?": ["1. You are sociable and outgoing. ", "2. You draw your energy from the outside world. ", "3. You talk about your thoughts and feelings and have great communication skills. ", "4. You are adaptable to every situation and are innovative when problems arise. ", "5. You are good at multitasking and prefer to work in a team rather than individually. ", "6. You look for inspiration and ideas from outside sources. "], "How do you grasp and process the information?": ["1. You are observant. ", "2. Your decisions depend on facts and figures. ", "3. You are rational and realistic. ", "4. You focus on the present and have a reasonable approach. ", "5. You use experience and common sense to solve problems.", "6. You apply all your senses. "], "How do you make the decisions?": ["1. You enjoy technical and scientific fields where logic is important.", "2. You look for logical explanations or solutions to everything.", "3. You make decisions rationally. ", "4. You are task-oriented and focused. ", "5. You are ruled by your head instead of your heart.", "6. You are a critical thinker and oriented toward problem-solving."], "How do you prefer to plan the work ?": ["1. You are spontaneous with the given tasks.", "2. You are a Multitasker. ", "3. You don't need a plan or clarity to start work.  ", "4. You want to be independent. ", "5. You dislike structure and are carefree. ", "6. You tend to be flexible and adaptable. ", "7. You always keep your options open."]}, "Communication Style": "You tend to be persuasive, energetic communicators. You quickly observe the realities of the present situation and engage others to take action on practical problems. Many times you speak very freely and can be blunt and impatient in getting your message across. You may not want to wait for someone else to buy in before you can act. Then you may come off as charming, and you are a master at negotiating with others so that you can achieve your goals in the most efficient way possible.", "Values and Motivations": "You are often natural athletes; you easily navigate their physical environment and are typically highly coordinated. You like to use this physical aptitude in the pursuit of excitement and adventure, and you often enjoy putting their skills to the test in risky or even dangerous activities.\nYour focus is action at the moment. You are engaged with their environments and solve practical problems quickly. You are excellent in emergencies when you can apply their logical reasoning to situations where immediate action is necessary. Long-term goals are less interesting to you, who prefers to see tangible results at the moment.", "Work Place Habits": "At work, you are motivated to solve logical problems at the moment. You have a solid grasp of the concrete realities of a situation and a good sense of the resources at your disposal. Because you understand the facts of the present, you are often able to quickly see a way out of difficult situations.\nYou rely on past experience to choose the best approach for the situation at hand. you are concrete and hands-on and have a kinetic sense of how things work. Although you may have trouble envisioning abstract ideas, you are flexible in your approach: if something sounds logical, you are usually willing to give it a try.\nYou often choose careers that take advantage of your athleticism, your mechanical skills, or your ability to negotiate your physical surroundings. You tend to prefer objects to ideas and often like a tangible product. You may have trouble sitting still and often avoid being stuck behind a desk.\nYou like a job that is a bit unpredictable and offers you some fun and adventure throughout the workday. You want a job which allows you plenty of flexibility to solve problems on the spot, without pressure to follow set procedures or plans.", "How Others Perceive You": "The first thing you notice about you is likely to be your energy. You’re often chatting, joking, and flirting with friends and strangers alike. You enjoy engaging playfully with others and amusing everyone around you with your irreverent sense of humour. You tend to keep people on your toes, never quite knowing what you will poke fun at next. You are unabashedly gregarious with people, but your interest in individuals may not last long; you are more likely to work a room, having a laugh with everyone than you are to engage in-depth with any one person.\nYou are comfortable in your physical environment and always looking for some action or activity. You tend to be the most naturally coordinated of all the types and are often found playing sports or engaging in various physical activities, especially ones with an element of danger. You are the stereotypical “adrenaline junkies” and may be found skydiving, motorcycle racing, or enjoying other extreme sports.", "Growth Potential": {"Look inward. ": "You will benefit from taking time for self-reflection and introspection, especially as you age. Throughout your life, you are prone to focus externally, always responding to your environments and the needs of the moment. The constant attention to things outside of yourself can distract you from healthy introspection, causing you to overlook important aspects of your own character and development and leave personal blind spots unaddressed. ", "Consider the consequences": "You are natural a risk-taker, prone to pursue adventure and risky behaviours. Naturally, this invites the potential for disastrous consequences. Though you are quite confident in your abilities and usually accurate in these personal assessments, you will benefit from greater time spent considering the potential outcomes of your actions and decisions", "Think ahead": "You live life so much in the present that you are often incapable of effectively planning for the future. Though you do enjoy flying by the seat of your pants, you will find you benefit from composing at least a loose plan or framework. It isn’t necessary to follow it exactly, but it can help ensure that you move in the direction of meeting your personal and professional goals. You may benefit from help with long-range future planning as well as developing time management skills. ", "Follow through": "Constant living and responding at the moment can impede follow through and follow up. People of this type must endeavour to balance the acute with the chronic, the emergency situation or deadline with regular life. You should try to look at the whole project or problem and its future impact, not just the urgent piece. For you it is easy, and even comfortable, to jump from urgency to urgency, putting out fires one by one. But jobs need to be finished and wrapped up before hopping to the next task. ", "Check the rulebook": "You naturally follow your own plans, systems and internal codes. This isn’t because you are intentionally insubordinate, but because you often don’t consider that there may be rules or established protocol that should be considered before plunging ahead. You will avoid unnecessary conflict and tension in the workplace if you can remember to get your plans approved before getting started. "}, "Careers to Avoid": ["1. Writer", "2. Librarian", "3. Curator", "4. Craft Artist", "5. Animator", "6. Clergy\t", "7. Physician Assistant", "8. Medical Assistant", "9. Veterinary Technician", "10. Public Health Nurse", "11. Dental Hygienist", "12. Preschool Teacher", "13. Electrical Engineer", "14. Chemical Engineer", "15. Electronics Technician", "16. Chemist", "17. Market Researcher", "18. Organizational Psychologist", ""]}, "INFJ": {"Strengths and Weaknesses": {"Strengths": {"Practical insight": "Some people are visionaries while others are down-to-earth problem solvers, but you manage to straddle the line between both identities—and you usually succeed masterfully. You are an insightful thinker who sees through situations and people effectively and enjoys developing practical strategies for action. ", "Compassion": "As a Feeling type, you might expect you to show compassion—but what sets you apart is that your empathy comes with a sharp intuitive edge. You are quick to recognize worry and unhappiness in friends and loved ones, even when outward signs of distress are not visible to others. You are uniquely capable of detecting unspoken and unacknowledged suffering and are called into action by your instinctive ability to see beneath the surface.", "Keeping the peace": "Mediating disputes is hard work, but you have an astounding ability to help heal the rifts that divide people. You intuitively sense the real suffering that anger can cause if left to fester, and because you are good listeners you are quite effective at helping warring parties find workable solutions that will satisfy the needs of all. And you do it with great energy and determination.", "Decisiveness": "For you, obstacles exist to be overcome and no problem can outmatch the strength and resilience that these types possess deep inside. You follow through on your ideas with conviction and have the willpower and decisiveness necessary to see projects through to the end. You live for the opportunity to solve problems and bring about positive change in the world."}, "Weaknesses": {"Overlooking details": "No matter how practically-oriented you aspire to be, you have a tendency to get so caught up in theorizing the big picture that you forget to account for some of the precious details that can separate success from failure. Details always matter, and while you may recognize this in principle, in practice you aren’t always as diligent about the small stuff as you should be. ", "Intensely private": "Despite your loving and sensitive natures, you have a tendency to close yourself off from the world and don’t give people the chance to know you or see the wonderful qualities you possess. Even in your relations with family and trusted friends, you can be enigmatic. When you are feeling frustrated or introspective, you may retreat from social contact without so much as a word of explanation, which can throw others for a loop.", "Conflict averse": "You dislike conflict intensely and will usually intervene to stop it, but this is one area where your perspective can get distorted. You often fail to recognize that conflict can actually serve a useful purpose, allowing a good process of give-and-take to be established and giving all parties the opportunity to resolve your problem forever. You would be wise to acknowledge the value of open and honest dialogue, instead of automatically assuming that all squabbling is harmful.", "Sensitive": "Once you have made up your mind, you tend to be very confident in your conclusions and may not have much tolerance for those who continue to dissent. When someone challenges your conclusions, you can react very strongly and are especially vulnerable to criticism."}}, "Personality Description": {"Name": "The Mentor", "Two Line Description": "You're someone who through their kind and dedicated attitude can sense others' emotions even before they know it and provide help to their personal challenges. ", "Description": "You are creative nurturers with a strong sense of personal integrity and a drive to help others realize their potential. Creative and dedicated, you have a talent for helping others with original solutions to their personal challenges.\nThe Counselor has a unique ability to intuit others' emotions and motivations, and will often know how someone else is feeling before that person knows it himself. You trust their insights about others and have strong faith in their ability to read people. Although you are sensitive, you are also reserved; you are a private sort and are selective about sharing intimate thoughts and feelings.", "Where do you prefer to focus your energy and attention?": ["1. You gain energy from reflection and lose energy in social gatherings. ", "2. You are passionate and not usually aggressive. ", "3.You are a good listener. ", "4. You are quiet, reserved and self-sufficient.", "5. Gain energy from focusing your mind. ", "6. You are highly Intellectual. ", "7. You are a deep thinker. ", "8. You prefer to work alone and not in groups. "], "How do you grasp and process the information?": ["1. You are imaginative and think out of the box. ", "2. You are innovative, hypothetical and have a futuristic approach towards life. ", "3. You are highly observant and a deep thinker. ", "4. You are aware of yourself and your surroundings. ", "5. You prefer to read between the lines and recognise the connection between random facts ", "6. Ideas inspire you and you are more likely to focus on the theory than the practice of a project."], "How do you make the decisions?": ["1. You decide with heart and dislike conflict. ", "2. You are passionate and driven by emotion. ", "3. You are empathetic and like taking care of others. ", "4. You pay attention to your moral compass to determine right from wrong and are less interested in the cold, hard facts.", "5. You consider the effect of your actions on other people", "6. you are concerned with values and what is best for the people involved."], "How do you prefer to plan the work ?": ["1. You prefer being organised and live a planned or orderly way of life. ", "2. You like to be involved in tasks where there is a standard procedure and do not like ambiguity ", "3. You like to take charge of things and take responsibilities and leading roles.", "4. You are self-disciplined and decisive.", "5. You don't procrastinate and complete your work on time. "]}, "Communication Style": "You are reserved about communication, and often keep your most treasured ideas and insights private. You are oriented to values and connection and will search for meaning in the information you take in. You think deeply and often need time to process and evaluate before you are ready to share your ideas. You seek validation and will take the time to appreciate others and your ideas. You are often talented at making connections to bring people together and integrate ideas, values, and human potential.", "Values and Motivations": "You are guided by a deeply considered set of personal values. You are intensely idealistic, and can clearly imagine a happier and more perfect future. You can become discouraged by the harsh realities of the present, but you are typically motivated and persistent in taking positive action nonetheless. You feel an intrinsic drive to do what you can to make the world a better place.\nYou want a meaningful life and deep connections with other people. You do not tend to share yourself freely but appreciate emotional intimacy with a select, committed few. Although their rich inner life can sometimes make you seem mysterious or private to others, you profoundly value authentic connections with people you trust.", "Work Place Habits": "At work, you are focused on the task of bettering the human condition. You are dedicated, helpful, and principled workers who can be relied on to envision, plan, and carry out complex projects for humanitarian causes.\nAlthough you are typically driven by lofty ideals, Counselors gain the most satisfaction from your work when you can turn your ideas into reality, creating constructive change for other people.\nYou are typically organized and prefer work that allows you to complete projects in an orderly manner. You are often independent and tend to prefer a quiet environment that allows you the opportunity to fully develop your own thoughts and ideas.\nThe ideal work environment for you is harmonious, industrious, and oriented to a humanitarian mission, with co-workers who are similarly committed to positive change. The ideal job for a Counselor allows you to use your creativity in an independent, organized environment to develop and implement a vision that is consistent with your personal values.", "How Others Perceive You": "You often appear quiet, caring and sensitive, and may be found listening attentively to someone else’s ideas or concerns. You are highly perceptive about people and want to help others achieve understanding. You are not afraid of complex personal problems; in fact, you are quite complex yourself and have a rich inner life that few are privy to. You reflect at length on issues of ethics and feel things deeply. Because Counselors initially appear so gentle and reserved, you may surprise others with your intensity when one of your values is threatened or called into question. Your calm exterior belies the complexity of your inner worlds.\nBecause you are such complex people, you may be reluctant to engage with others who might not understand or appreciate you and can thus be hard to get to know. Although you want to get along with others and support you in your goals, you are fiercely loyal to your own system of values and will not follow others down a path that does not feel authentic to you. When you sense that your values are not being respected, or when your intuition tells you that someone’s intentions are not pure, you are likely to withdraw.", "Growth Potential": {"Question your intuition": "You have outstanding instincts for the most part, but sometimes your intuition betrays you when you are dealing with others. When something is bothering you, you will often withdraw into the safety of your own heads rather than speaking openly about what you are feeling; conversely, you seldom express your feelings of love, affection and appreciation as directly as might be expected given the depth of the emotions you experience. To improve your communication habits, you should go out of your way to share your feelings—both good and bad—with others regardless of how uncomfortable it makes you feel to do so. ", "Give others the benefit of the doubt. ": "You are insightful, instinctive and persuasive. But despite the enormous effort that you invest in developing and selling your concepts and ideas, sometimes dissidents will remain. You sometimes become disenchanted with those who refuse to accept your conclusions, and you will convince yourself that your opponents have hidden agendas and are acting in bad faith. When situations like this arise, you should try to accept that total consensus is impossible and that some will continue to hold contrary viewpoints. In situations like this, both sides should simply agree to disagree and move on. ", "Let others agree to disagree, too. ": "When tensions are high and arguments are heated, you will do all you can to restore lost cohesion and tranquillity. But your love of harmony and aversion to division is so powerful that you refuse to accept that sometimes the best way to end disputes is to bring them out into the open, where bridges of understanding can be built. On balance, your dislike of conflict is a good thing. But your efforts to play peacemaker might be more successful if you would concentrate on keeping the lines of communication open when disagreements arise instead of always trying to sweep everything under the rug. ", "Make connections with extraverts": "Because sharing with anyone outside a small trusted circle goes against your instincts, too often talented you choose to keep your gifts wrapped up and hidden even though you have much to contribute. But you would benefit by cultivating friendly relationships with extraverted people whenever possible. Opposites attract, and there is no doubt that being around more naturally open and communicative people can help bring you out of your shells and out into the world where others can benefit from your intellect, empathy and compassion. ", "Slow down! ": "You are productive and effective when you make a concerted effort to focus on one project at a time. But your fertile imaginations frequently undermine your efforts to stay on the straight and narrow, and you will often start new projects based on fresh inspirations before old ones are finished—and, before you know it, you will find yourself buried under an avalanche of work. There is really nothing you can do to moderate the pace of your inspirations, but if you constantly remind yourself to slow down and take things one at a time, you may be able to resist the urge to go off on tangents at least some of the time. "}, "Careers to Avoid": ["1. General Contractor", "2. Electrician", "3. Engineering Technician", "4. Mechanic", "5. Surveyor", "6. Farmer", "7. Real Estate Broker", "8. Sales Manager", "9. Restaurant Manager", "10. Property Manager", "11. Financial Manager", "12. Factory Supervisor", "13. Military Officer", "14. Police Officer", "15. Firefighter", "16. Paramedic", "17. Medical Records Technician", "18. Cook"]}, "INFP": {"Strengths and Weaknesses": {"Strengths": {"Idealism": "You care deeply for others and believe it is your duty to make a positive impact on the lives of other people in any way you can. Because of this unbreakable commitment, you are capable of great self-sacrifice, and you won’t compromise your ethical standards for personal benefit. You are firm believers in the unlimited potential of human beings to achieve remarkable things, and you can always be counted on to provide encouragement or material support to those who are attempting to expand your horizons.", "Integrity": "Integrity means everything to you, and that includes intellectual as well as moral integrity. Some people might accuse you of being overly imaginative or of being willing to stretch logic to the breaking point in order to find the deeper meaning you insist must exist, but there is no denying that the deeply reflective nature of you allows you to transcend the boundaries of imagination that so often prevent us from discovering new solutions to old problems.", "Compromise": "As empathic idealists, harmonious relations are like a balm to the soul for you. In family settings or when working in groups, you are highly effective as mediators because you are legitimately interested in the viewpoints of all and will go out of your way to make sure that everyone is given a fair hearing. You are enthusiastic advocates of cooperation and believe that no difficulty is insurmountable when people work together for a common cause. ", "Dedication": "It is easy to pay lip service to virtues like compassion, creativity, originality and open-mindedness, but these ideas don’t mean much unless you can be translated into real-world applications. Fortunately, you are masters at doing just that. Passionate and committed to the cause, these personalities have a unique ability to mould and shape your surrounding environment in ways that promote self-improvement and transcendent achievement for all."}, "Weaknesses": {"Sensitivity": "Your deep compassion, sensitivity and commitment to originality allow you to interface with your interpersonal landscapes in a constructive manner, but these feelings also leave you vulnerable to disillusionment and powerful existential angst. You who venture enthusiastically out into the world can end up retreating into lethargy and depression when you discover your idealism isn’t always shared or respected by others, and your incredible talents can go completely to waste when you become too discouraged to continue.", "Impracticality": "While your insistence on standing up for justice and decency is admirable, the intensity of your feelings can occasionally leave you unwilling to make compromises even when doing so might be necessary to get something accomplished. Sticking to your morals is admirable, but in the real world, it may be impossible to accomplish anything unless you can find a way to give and take a little and find practical if imperfect, solutions to problems. ", "Selflessness": "You have a tendency to neglect or suppress your own needs if you believe it is necessary to keep the peace or make others happy. When a person holds his or her insecurities inside for too long, it can eventually cause a blow-up or an emotional breakdown. Sensitively, you often suffer in silence, and this is a pity because you and your fellow travellers usually have people in their lives who care about you a lot and would be more than happy to help you deal with your heartaches and disappointments. ", "Vulnerability": "Compassionate to the core, you lead with your hearts rather than your heads and this can sometimes set you up for trouble. Unfortunately, there are users and manipulators out there who are always on the lookout for easy targets, and from the standpoint of these individuals you might as well have flashing neon signs attached to your foreheads that say “exploit me, exploit me!” Trust is a wonderful thing, but not when it makes you gullible. "}}, "Personality Description": {"Name": "The Curer", "Two Line Description": "You like spending time in the ocean of your thoughts and ideas and are concerned about your personal growth and that of the people around you.", "Description": "You are an imaginative idealist, guided by your own core values and beliefs. To a Healer, possibilities are paramount; the realism of the moment is only of passing concern. You see the potential for a better future and pursue truth and meaning with their own individual flair.\nYou are sensitive, caring, and compassionate, and are deeply concerned with the personal growth of yourself and others. Individualistic and nonjudgmental, you believe that each person must find their own path. You enjoy spending time exploring their own ideas and values and are gently encouraging to others to do the same. You are creative and often artistic; you enjoy finding new outlets for self-expression.", "Where do you prefer to focus your energy and attention?": ["1. You gain energy from reflection and lose energy in social gatherings. ", "2. You are passionate and not usually aggressive. ", "3.You are a good listener. ", "4. You are quiet, reserved and self-sufficient.", "5. Gain energy from focusing your mind. ", "6. You are highly Intellectual. ", "7. You are a deep thinker. ", "8. You prefer to work alone and not in groups. "], "How do you grasp and process the information?": ["1. You are imaginative and think out of the box. ", "2. You are innovative, hypothetical and have a futuristic approach towards life. ", "3. You are highly observant and a deep thinker. ", "4. You are aware of yourself and your surroundings. ", "5. You prefer to read between the lines and recognise the connection between random facts ", "6. Ideas inspire you and you are more likely to focus on the theory than the practice of a project."], "How do you make the decisions?": ["1. You decide with heart and dislike conflict. ", "2. You are passionate and driven by emotion. ", "3. You are empathetic and like taking care of others. ", "4. You pay attention to your moral compass to determine right from wrong and are less interested in the cold, hard facts.", "5. You consider the effect of your actions on other people", "6. you are concerned with values and what is best for the people involved."], "How do you prefer to plan the work ?": ["1. You are spontaneous with the given tasks.", "2. You are a Multitasker. ", "3. You don't need a plan or clarity to start work.  ", "4. You want to be independent. ", "5. You dislike structure and are carefree. ", "6. You tend to be flexible and adaptable. ", "7. You always keep your options open."]}, "Communication Style": "You are a gentle, encouraging communicator who enjoys exploring options and ideas. You envision possibilities for people and are often good at coming up with creative, flexible solutions to problems. You are a typically attentive listener who tries to adapt your communication style to the people you are dealing with. Compassionate and cooperative, you tend to be appreciative of other people and their ideas, although you may be reserved about sharing your own closely held values and ideas with people you do not know well.", "Values and Motivations": "You value authenticity and want to be original and individual in what you do. You are often concerned with a search for meaning and truth within yourself. Following tradition holds little appeal for you; you prefer to do their own exploration of values and ideas and decide for yourself what seems right. You are often offbeat and unconventional, but you feel no desire to conform. You would rather be true to yourself than try to fit in with the crowd.\nYou are accepting and nonjudgmental in their treatment of others, believing that each person must follow their own path. You are flexible and accommodating, and can often see many points of view. It is important to you to support other people; however, you may react strongly if you feel their own values are being violated. You especially hate being steamrolled by people who insist there is one right way to do things. You want an open, supportive exchange of ideas.", "Work Place Habits": "At work, you are not particularly driven by money or status, preferring work that aligns with your personal values and allows you to help others. You are typically motivated by vision and inspiration and want to engage with projects and causes that feel important to you.\nYou enjoy the process of creative problem-solving and want to understand complex issues. You appreciate innovation and want to come up with original ideas to improve circumstances for people. An ideal job for a Healer allows you to express your individuality in the way you work and takes advantage of your ability to see unique solutions.\nYou enjoy working autonomously and having control over how and when to complete a project. You often enjoy participating in teams, although you want to be free to put your own personal stamp on your work. When you do work with other people, it's important to you that you be cooperative, supportive, and flexible, and that you have a similar passion for your ideals.", "How Others Perceive You": "You may initially seem cool, as you reserve your most authentic thoughts and feelings for people you know well. You are reflective and often spiritual, and often interested in having meaningful conversations about values, ethics, people, and personal growth. Typically curious and open-minded, the Healer continually seeks a deeper understanding of yourself and of the people around you. You are passionate about your ideas, but private as well; few people understand the depth of your commitment to your beliefs.\nYou are sensitive and empathetic, and engage yourself in a lifelong quest for meaning and authenticity. The mundane aspects of life are of less interest to this type, and you are more excited by interesting ideas than by practical facts. You typically accept others without question and may take a special interest in offbeat points of view or alternative lifestyles. You often have a special affection for the arts, especially the avant-garde, as you love experiencing new concepts in self-expression.", "Growth Potential": {"Learn to recognize the difference between compromise and concession. ": "People who disagree with you are simply seeing things from a different point of view, but to you, it can feel like you are being backed into a corner. Instead of digging in your heels, you must find a way to detach from the situation so you can comprehend the motivations of your opposition more clearly. If it is only a difference in values and not a lack of you that is responsible for divergent opinions, then you should not expect others to give in to stubbornness any more than you would if the shoe were on the other foot.", "Make sure dreams and fantasies are used to enhance reality rather than replace it": "You who look out at the world with idealistic eyes often see grand vistas of beauty and limitless possibility that others are not capable of perceiving. But you sometimes choose to retreat into these fantasies instead of using you to solve real-world problems. Imagination can open the door to better possibilities, and you should never lose sight of its transformative potential. ", "Learn to respect the details": "No matter how wonderfully inventive a new idea might be, it won’t get anywhere if the logistical details required to put it into practice are ignored or neglected. You may find this aspect of the creative processes a bit boring, but you should challenge yourself to overcome your disinterest and pay attention to all those annoying details anyway. ", "Seek out leadership positions": "You have strong egalitarian instincts, are natural conciliators, passionately believe in the utility of cooperation, are excellent listeners, and never fail to pay attention when someone has a new idea to share. These admirable qualities double as superb leadership skills, and no one who possesses them should avoid leadership positions simply because you aren’t extraverts. Above all else, leaders must have the respect of those you presume to lead, and you are just as capable of gaining that respect as any other personality type. ", "Accept yourself as you are without apology. ": "Because your standards are so high, you have a hard time forgiving yourself when you fail to meet your own expectations. You may also become indecisive and fall into perfectionism so extreme that it cuts off your flow of creativity and makes it impossible for you to excel and achieve. This dynamic is unfortunate, especially as you would never think of holding others to such impossible standards. For the sake of your mental health and happiness, you must learn to stop comparing yourself to others and recognize that you should prioritize your own happiness."}, "Careers to Avoid": ["1. Military Officer", "2. Police Officer", "3. Materials Engineer", "4. Electrician", "5. Systems Analyst", "6. Sales Manager", "7. Financial Manager", "8. Auditor", "9. Cost Estimator", "10. Engineering Technician", "11. Chemist", "12. Chemical Engineer", "13. Dentist", "14. Licensed Practical Nurse", "15. Judge"]}, "INTJ": {"Strengths and Weaknesses": {"Strengths": {"Strategy": "You not only see the plan or course of action, but you are also ready and prepared with several back-ups depending on the various circumstances that could possibly arise. With your expansive, future-focused vision for seeing possibilities and recognizing potential, you are also detailed and logical enough to see holes, gaps and inconsistencies. ", "Innovation": "Though you may outwardly appear intractable, as a type you are actually quite receptive to and supportive of change and innovation, and this open approach helps to enhance your problem-solving savvy. You believe that most people, processes and systems have the potential to be improved upon and you will seek new and creative ways to try to bring about that change.", "Determination": "You are revered for your bravery and steadfastness in the face of challenge. You are characteristically determined in whatever you are doing, even to the point of relentless, and are not afraid to move in to tackle the really difficult challenges. Rather than feeling daunted or frustrated, this excites and exhilarates you. You trust your judgment and are confident in your ability to solve the problems and overcome the challenges you encounter in your personal or professional lives.", "Willingness to Learn": "You aren’t only looking to change externals and other people. you are also diligently committed to working on yourself. Though you won’t typically dwell long upon your feelings and emotional state, you are fully engaged in the work of self-improvement. You are lifelong learners and will always be looking for ways to increase your knowledge and skills."}, "Weaknesses": {"Superiority": "Your prowess in the area of intellect, logic and reason is unarguable and definitely among your chief strengths, as is your confidence in your ideas. However, these strengths can turn into weaknesses when you morph into a superiority complex. Unfortunately, among people like you, this is not uncommon. You may be arrogant and condescending, as well as impatient with people who don’t catch on as quickly as you’d like. With those who demonstrate less ability to think logically and rationally, you may be particularly judgmental and intolerant.", "Emotional Distance": "You are also known for your low EQ and unwillingness to engage the emotions—your own or others. Preferring to conceptualize the world on a logical, rational basis, you tend to have little patience for emotional concerns. You struggle to pick up on and respond to the emotional cues and needs of others. This can stifle interpersonal relationships, as well as your own growth and development, and may end up keeping others at (at least) arm’s distance.", "Perfectionism": "While the meticulousness of you can be a strength, as in all things, too much of a strength can easily become a weakness, and for you, this natural fastidiousness quickly becomes perfectionism, and in this, you can be quite fierce and painstaking. Your standards, in general, are exacting and this critique may be directed not only toward yourself but toward others as well. ", "Imbalance": "You place a high priority on work and will be quite devoted to his or her professional life. But this comes at a price, namely in time that might be spent on family, other relationships and leisure. It is easy for you to find him or herself with misplaced priorities and, as a result, relational problems. While your drive to succeed professionally can certainly pay off, it can take a toll on the rest of your lives."}}, "Personality Description": {"Name": "The Inventor", "Two Line Description": "You're someone who is wise enough to solve problems analytically; you like putting your mind to complex problems and enjoy finding solutions to them,", "Description": "You are analytical problem-solvers, eager to improve systems and processes with their innovative ideas. You have a talent for seeing possibilities for improvement, whether at work, at home, or in yourself.\nOften intellectual, you enjoy logical reasoning and complex problem-solving. You approach life by analyzing the theory behind what you see and are typically focused inward, on their own thoughtful study of the world around you. You are drawn to logical systems and are much less comfortable with the unpredictable nature of other people and their emotions. you are typically independent and selective about their relationships, preferring to associate with people who you find intellectually stimulating.", "Where do you prefer to focus your energy and attention?": ["1. You gain energy from reflection and lose energy in social gatherings. ", "2. You are passionate and not usually aggressive. ", "3.You are a good listener. ", "4. You are quiet, reserved and self-sufficient.", "5. Gain energy from focusing your mind. ", "6. You are highly Intellectual. ", "7. You are a deep thinker. ", "8. You prefer to work alone and not in groups. "], "How do you grasp and process the information?": ["1. You are imaginative and think out of the box. ", "2. You are innovative, hypothetical and have a futuristic approach towards life. ", "3. You are highly observant and a deep thinker. ", "4. You are aware of yourself and your surroundings. ", "5. You prefer to read between the lines and recognise the connection between random facts ", "6. Ideas inspire you and you are more likely to focus on the theory than the practice of a project."], "How do you make the decisions?": ["1. You enjoy technical and scientific fields where logic is important.", "2. You look for logical explanations or solutions to everything.", "3. You make decisions rationally. ", "4. You are task-oriented and focused. ", "5. You are ruled by your head instead of your heart.", "6. You are a critical thinker and oriented toward problem-solving."], "How do you prefer to plan the work ?": ["1. You prefer being organised and live a planned or orderly way of life. ", "2. You like to be involved in tasks where there is a standard procedure and do not like ambiguity ", "3. You like to take charge of things and take responsibilities and leading roles.", "4. You are self-disciplined and decisive.", "5. You don't procrastinate and complete your work on time. "]}, "Communication Style": "You are direct and detached in your communication. You often naturally see how something could be done better and usually communicate your criticism in a straightforward, logical manner. You are typically independent and calm; you are not so much concerned about being liked or appreciated as you are with being competent and thoughtful. Your communications are typically well-thought-out, insightful, and strategic. You often plan well into the future and offer big-picture analysis for improving systems.", "Values and Motivations": "You are perceptive about systems and strategy, and often understand the world as a chessboard to be navigated. You want to understand how systems work, and how events proceed: you often have a unique ability to foresee logical outcomes. You enjoy applying yourself to a project or idea in-depth, and putting in concentrated effort to achieve their goals.\nYou have a hunger for knowledge and strive to constantly increase their competence; you are often perfectionists with extremely high standards of performance for yourself and others. You tend to have a keen interest in self-improvement and are lifelong learners, always looking to add to their base of information and awareness.", "Work Place Habits": "At work, you excel at creating and implementing innovative solutions to analytical problems. You naturally see possibilities for improvement within complex systems and are organized and determined in implementing your ideas for change.\nYou are comfortable with abstraction and theory but gain the most satisfaction from turning your ideas into reality. You often enjoy working independently or with a small team, taking measured, strategic steps to implement change.\nYou enjoy working with logical systems that you can understand in depth. You enjoy the challenge of comprehending complex ideas and want to understand how you can improve the way things work.\nThe ideal work environment for you is logical, efficient, structured, and analytical, with colleagues that are competent, intelligent, and productive. The ideal job for a Mastermind allows you to use your analytical skills to problem-solve in a challenging environment and to take responsibility for implementing your ideas to create efficient, innovative systems.", "How Others Perceive You": "You are typically reserved and serious and seem to spend a lot of time thinking. You are curious about the world around you and often want to know the principle behind what you see. You thoroughly examine the information you receive, and if asked a question, will typically consider it at length before presenting a careful, complex answer. You think critically and clearly, and often have an idea about how to do something more efficiently. You can be blunt in your presentation, and often communicate in terms of the larger strategy, leaving out the details.\nAlthough you aren’t usually warm or particularly gregarious, you tend to have a self-assured manner with people based on your own security in your intelligence. You relate your ideas with confidence, and once you have arrived at a conclusion you fully expect others to see the wisdom in your perceptions. You are typically perfectionists and appreciate an environment of intellectual challenge. You enjoy discussing interesting ideas, and may get yourself into trouble because of your take-no-prisoners attitude: if someone’s beliefs don’t make logical sense, the Mastermind typically has no qualms about pointing that out.", "Growth Potential": {"Go outside of yourself": "You are internal processors and accustomed to finding the right answers or the best plans within your own minds. However, such a constant internal focus can mean you may miss important details, as well as the potentially insightful and helpful contributions of others. To improve your own ideas and plans, you should seek input from friends, family and colleagues. Though you have full confidence in his or her own abilities, conferencing with others can breathe new life into a stale approach and can help to uncover blind spots. ", "Go inside": "You don’t naturally introspect deeply or spend much time considering your emotional state. You focus internally on your many ideas and abstract concepts, but when it comes to looking at yourself and your feelings, you often avoid the activity. Out of touch with your own blind spots and character defects, you can be quick to find fault with others. One solution is to work on cultivating humility and compassion.", "Balance": "It is easy for you to become completely consumed with work or some project or plan that he or she has devised. At the moment, this will feel exhilarating for the individual but may have consequences for personal wellbeing and relationships in the long run. Then you should strive for better work-life balance. That also means, as mentioned, taking time to examine his or her emotions and responses. It won’t come naturally but will help interpersonal relationships immensely. ", "Pick your battles": "It is not necessary to argue every single point, though your thinking nature will compel him or her to do so. This is the default response of your perfectionistic hyper-logical nature. Thus, to better navigate all areas of life, the individual may need to understand that sometimes you have to let the small things go so you can accomplish the big things in the long run. ", "If it ain’t broke…and even if it is": "You may need to resist the desire to be continually improving and changing. Your view on potential and possibilities for all products, systems and people, leads you to want to always be fixing and “improving.” What you may not realize is that not all people want to be fixed and not all companies want greater efficiency. "}, "Careers to Avoid": ["1. Receptionist", "2. Hotel Clerk", "3. Secretary", "4. Telemarketer", "5. Recreation Worker", "6. Teacher's Aide", "7. Preschool Teacher", "8. Home Health Aide", "9. Production Worker", "10. Advertising Sales Agent", "11. Dental Hygienist", "12. Licensed Practical Nurse", "13. Medical Assistant", "14. Nurse's Aide", "15. Social Worker"]}, "INTP": {"Strengths and Weaknesses": {"Strengths": {"Analytically brilliance": "Beneath the quiet surface sits an intellectual prowess which you bring to any environment in which you find yourself. You are fast thinkers and highly logical. Others may not know it since much happens inside your own head, yet this type excels in analyzing connections between seemingly random pieces of information and finding flawless explanations to problems that disorient most other personality types.", "Objective": "You are respected for your relentless pursuit of truth, objectivity and understanding. You make this the goal of your lives and channel your energy into rooting out errors and eliminating inconsistencies. You do this not only for your own personal enjoyment but because you see it as your main contribution to the world in whatever field you may find yourself. ", "Imaginative": "You think deeply about theory, how to understand and explain difficult concepts, and how systems and products function and might be improved. You naturally see things others don’t because you have imaginations that are actively focused and fixated on future potential and possibility. ", "Enthusiastic": "To others, you may come across as private and withdrawn but when a topic piques your interest, you can be very enthusiastic⁠—excited even⁠—about discussing it. This excitement makes you fun to be around. In the right company, you are keen to express your imaginative sense of humour, and enjoy being playful with people who you can trust."}, "Weaknesses": {"Uncertainty": "Despite your intellectual prowess, you often live in fear of failure, anxious that you will overlook some critical aspect of your theory, idea or invention. This causes you to be self-conscious and to waste time and energy second-guessing yourself. ", "Absent-mindedness": "You aren’t labelled “absentminded professors” for no reason. At your worst, you tend to be scattered and disorganized. Intellectual and high-minded, you get caught up in your own brains and fail to deal with the low-level tedium of the here and now such as bills or deadlines. You fail may fail to conform to even the basic expectations of daily life in society. ", "Condescension": "A significant weakness of you is the tendency to be condescending and critical, either of your opponents or those who simply don’t catch on as quickly as you do. Your constant pursuit of truth and objectivity, though admirable, can also provoke brutality and impatience as you drive home your own perspective. This can be especially toxic in relationships in which logic simply does not always reign supreme. ", "Insensitivity": "You can get into trouble because of your tendency to prioritize the activity taking place in your minds over the needs of others. You comfortably inhabit the realm of your imaginations and this can bring certain problems, not least that you get so caught up in your own theories and abstractions that you forget any kind of emotional consideration. Your focus on ideas and logic, and neglect of personal considerations, can easily offend."}}, "Personality Description": {"Name": "The Designer", "Two Line Description": "You like working on systems and designs; it is important for you to spend time alone to figure out the mysteries of the universe.", "Description": "You are philosophical innovators, fascinated by logical analysis, systems, and design. You are preoccupied with theory and search for the universal law behind everything you see. You want to understand the unifying themes of life, in all their complexity.\nYou are detached, analytical observers who can seem oblivious to the world around you because you are so deeply absorbed in thought. You spend much of their time focused internally: exploring concepts, making connections, and seeking understanding. To the Architect, life is an ongoing inquiry into the mysteries of the universe.", "Where do you prefer to focus your energy and attention?": ["1. You gain energy from reflection and lose energy in social gatherings. ", "2. You are passionate and not usually aggressive. ", "3.You are a good listener. ", "4. You are quiet, reserved and self-sufficient.", "5. Gain energy from focusing your mind. ", "6. You are highly Intellectual. ", "7. You are a deep thinker. ", "8. You prefer to work alone and not in groups. "], "How do you grasp and process the information?": ["1. You are imaginative and think out of the box. ", "2. You are innovative, hypothetical and have a futuristic approach towards life. ", "3. You are highly observant and a deep thinker. ", "4. You are aware of yourself and your surroundings. ", "5. You prefer to read between the lines and recognise the connection between random facts ", "6. Ideas inspire you and you are more likely to focus on the theory than the practice of a project."], "How do you make the decisions?": ["1. You enjoy technical and scientific fields where logic is important.", "2. You look for logical explanations or solutions to everything.", "3. You make decisions rationally. ", "4. You are task-oriented and focused. ", "5. You are ruled by your head instead of your heart.", "6. You are a critical thinker and oriented toward problem-solving."], "How do you prefer to plan the work ?": ["1. You are spontaneous with the given tasks.", "2. You are a Multitasker. ", "3. You don't need a plan or clarity to start work.  ", "4. You want to be independent. ", "5. You dislike structure and are carefree. ", "6. You tend to be flexible and adaptable. ", "7. You always keep your options open."]}, "Communication Style": "You can be insightful communicators when the subject inspires you. Thoughtful and independent, you may not have a great need for conversation, but when discussing complex concepts or innovative ideas you can become quite intense and display a wealth of information and insight. Logical and analytical, you can weigh possibilities endlessly and are great at playing devil’s advocate. You love to pick apart ideas but are not convinced by anything but the most rational of analyses; you can spot a flaw in logic a mile away, and rarely hesitate to point it out.", "Values and Motivations": "You are perceptive about systems and strategy, and often understand the world as a chessboard to be navigated. You want to understand how systems work, and how events proceed: you often have a unique ability to foresee logical outcomes. You enjoy applying yourself to a project or idea in-depth, and putting in concentrated effort to achieve their goals.\nYou have a hunger for knowledge and strive to constantly increase their competence; you are often perfectionists with extremely high standards of performance for yourself and others. You tend to have a keen interest in self-improvement and are lifelong learners, always looking to add to their base of information and awareness.", "Work Place Habits": "At work, you are motivated to solve complex problems in an original, innovative way. Architects want to analyze systems and ideas thoroughly to create a deep understanding and enjoy designing creative solutions to highly abstract problems.\nYou rarely have much interest in organizational traditions, preferring to forge your own path to innovation. You hate being limited by bureaucracy and rules, and are often more in tune with the theoretical soundness of your ideas than you are with the practical applications. you typically prefer to focus on creating the idea and to leave the tedious details of implementation to someone else.\nYou work best independently or with a small team of colleagues that you perceive as smart, competent, and logical. You quickly tire of colleagues who are aggressive or overbearing and can be dismissive of people who aren't as clever as yourself.\nAn ideal organization for you is flexible and non-traditional and values ingenuity over conformity. An ideal job for you allows you to address complex theoretical or technical problems with creative, novel solutions.", "How Others Perceive You": "You are often thoroughly engaged in your own thoughts and usually appear to others to be offbeat and unconventional. Your mind is a most active place, and your inward orientation can mean that you neglect superficial things like home décor or appropriate clothing. You don’t tend to bother with small talk but can become downright passionate when talking about science, mathematics, computers, or the larger theoretical problems of the universe. Reality is often of only passing interest to the Architect, as you are more interested in the theory behind it all.\nYou are typically precise in your speech, and communicate complex ideas with carefully chosen words. You insist on intellectual rigour in even the most casual of conversations, and will readily point out inconsistencies of thought or reasoning. Social niceties may fall by the wayside for you who is more interested in analyzing logic, and you may offend others by submitting your dearly held values and beliefs to logical scrutiny.", "Growth Potential": {"Develop emotional intelligence": "Though you can make very good friends and partners, you are not overly warm or attentive to the feelings and emotional cues of others. While emotional receptiveness and responsiveness will not come naturally to people of this type, focusing on key behaviours that help other people to feel heard and cared for will expand your ability to relate and connect.", "Harness the power of relationships": "Though you are naturally solitary, you are not at your best when you neglect key relationships. You can easily become isolated, especially if you are working on a difficult problem. While you may be indifferent to how many friends or personal relationships you have, you who can learn to purposely cultivate your social and professional connections will be more successful—and happier in the end.", "Bring others in": "You can easily find yourself rutted or caught in your own blind spots and, given the amount of time you spend in solitude, you may not regularly enjoy the input of others that can help to put you back on course. By bringing other people into your inner worlds, you not only serve your relationships, but you also get important feedback that can help you to clarify your high-level ideas and make them understandable and useful to a wider audience. ", "Think practically": "This may be a challenge because you are not characteristically utilitarian or particularly pragmatic. This doesn’t mean you don’t value efficiency, but that you believe in the value of thinking and experimenting for its own sake, even if there is no practical value or outcome attached to it. While we need people who are committed to taking on dream projects and experiments simply because they’re good things to do, employers may be less sympathetic. You should step back and consider your projects from a practical stance. Will this idea actually work? Does it matter? Is this a product people would actually use? Does it have practical value?", "Become more charitable": "You will always be relentless about what is right, true and logical, but can become more charitable with time and effort. This will also involve working to understand and take into account the emotional concerns of others and seeking to develop empathy and compassion. You can start by trying to look at and understand your own emotions."}, "Careers to Avoid": ["1. Dental Hygienist", "2. Public Health Nurse", "3. Dental Assistant", "4. Licensed Practical Nurse", "5. Dietitian", "6. Corrections Officer", "7. Religious Educator", "8. Teacher's Aide", "9. Preschool Teacher", "10. Elementary Teacher", "11. Recreation Worker", "12. Cosmetologist", "13. Retail Salesperson", "14. Restaurant Manager", "15. Sales Manager"]}, "ISFJ": {"Strengths and Weaknesses": {"Strengths": {"Practical": "With a keen memory, an eagle’s eye for observation and an absolute determination to account for every detail, you are practical workers par excellence. When focused on a mission, you possess a Sherlock Holmes-like disposition to solve practical problems, built on an in-depth understanding of concrete facts. ", "Hardworking": "Intense and serious when a task needs to be completed, you are super-competent a go-getter who brings a hard-nosed approach to your work that can sometimes seem excessive to others. But it’s important to remember that you care deeply about people. When you put her game face on it is a sign that she believes what she is doing will improve people’s lives and is worth taking seriously. ", "Supportive": "You are the consummate helpers; happy to share your time and energy with anyone who needs it and taking an empathetic approach to problems and goals. As parents, partners, friends, students, workers, entrepreneurs, neighbours, community members, public servants and citizens, you always strive for excellence, and it is the inclusivity and comprehensiveness of your vision that forms your identity and gives you your unique ability to brighten every corner of the worlds you inhabit. ", "True to your word": "By now we are all familiar with the values that you hold dear: honour, integrity, responsibility, loyalty and commitment. This is all well and good, but to you, it is far more important to walk the walk than talk the talk, and this is where you shine like the brightest stars. In business and personal relations, you are straight shooters who say what you mean and mean what you say. Your word is as good as gold. "}, "Weaknesses": {"Resistant to change": "You regard to custom and tradition with the utmost respect and can become anxious with a world you see changing too fast and people who refuse to follow established standards. You in full \"tut-tut/tsk-tsk\" mode may convince yourself that moral decay and a loss of respect for personal responsibility are destroying our society from the inside out, and you can become so immersed in pessimism that you will start seeing signs of degeneration and devolution everywhere you look. Diversity of thought and opinion is truly the spices of life, but you can become so enamoured with orthodoxy that you forget this essential fact of existence. ", "Too altruistic": "Loyalty is an admirable character trait to be sure, but it is a two-way street, and if the people we choose to trust prove to be dishonest or unreliable we must be prepared to walk away. Yet you struggle with letting go, and have a tendency to stay in it to the bitter end, convinced that this is the only honourable thing to do.", "Take things personally": "You are very private people, bordering on the shy, and this does not always mesh well with more open, unpredictable personality types. The social complexity of the environments you inhabit can overwhelm you and leave you feeling like square pegs in a universe of round holes. You have trouble dealing with conflict and a tendency to take even minor criticism personally. Combined with your stubborn streak, this can leave you feeling vulnerable and put upon, and you may resort to judgmental criticism yourself as a defence mechanism. ", "Overload yourself": "You are known for your terrific work ethic, but over time this positive trait can transmute into workaholism and leave you so overloaded that she loses sight of everything else. Workaholic you can be driven to distraction by your perfectionist tendencies, and even on those rare occasions when you manage to tear yourself away from the office and return home for a while, you will continue to obsess over your latest project or assignment, leaving you too distracted and preoccupied to enjoy your free time. "}}, "Personality Description": {"Name": "The Guardian", "Two Line Description": "You’re an all time contributor to society who is compassionate about saving others from any kind of jeopardy.", "Description": "You are industrious caretakers, loyal to traditions and organizations. You are practical, compassionate, and caring, and are motivated to provide for others and protect them from the perils of life.\nYou are conventional and grounded, and enjoy contributing to established structures of society. You are steady and committed workers with a deep sense of responsibility to others. You focus on fulfilling their duties, particularly when you are taking care of the needs of other people. You want others to know that you are reliable and can be trusted to do what is expected of you. You are conscientious and methodical, and persist until the job is done.", "Where do you prefer to focus your energy and attention?": ["1. You gain energy from reflection and lose energy in social gatherings. ", "2. You are passionate and not usually aggressive. ", "3.You are a good listener. ", "4. You are quiet, reserved and self-sufficient.", "5. Gain energy from focusing your mind. ", "6. You are highly Intellectual. ", "7. You are a deep thinker. ", "8. You prefer to work alone and not in groups. "], "How do you grasp and process the information?": ["1. You are observant. ", "2. Your decisions depend on facts and figures. ", "3. You are rational and realistic. ", "4. You focus on the present and have a reasonable approach. ", "5. You use experience and common sense to solve problems.", "6. You apply all your senses. "], "How do you make the decisions?": ["1. You decide with heart and dislike conflict. ", "2. You are passionate and driven by emotion. ", "3. You are empathetic and like taking care of others. ", "4. You pay attention to your moral compass to determine right from wrong and are less interested in the cold, hard facts.", "5. You consider the effect of your actions on other people", "6. you are concerned with values and what is best for the people involved."], "How do you prefer to plan the work ?": ["1. You prefer being organised and live a planned or orderly way of life. ", "2. You like to be involved in tasks where there is a standard procedure and do not like ambiguity ", "3. You like to take charge of things and take responsibilities and leading roles.", "4. You are self-disciplined and decisive.", "5. You don't procrastinate and complete your work on time. "]}, "Communication Style": "You take a supportive role in communication, listening to tune into the needs of others. You tend to be sensitive and want to collaborate to support everyone involved. You rarely demand the floor but are often quietly taking in detailed information from the world around you. You contribute information when you see a practical use for it or when you see that it could be helpful. You are loyal to what you see first-hand, and will often share perspectives based on personal experience.", "Values and Motivations": "You are driven by their personal values and are conscientious in their behaviour. You typically want to work hard, get along with others, and make sure you do what is expected of you.\nYou value relationships highly and strive to cooperate and maintain harmony with others. You want stability and longevity in their relationships and tend to maintain a deep devotion to family. You feel most connected with people you know you can rely upon over the long term.\nYou appreciate tradition and like knowing how things were done in the past. You are loyal to established methods and values and want to observe the proper, accepted way of doing things. You place great importance on fitting in with established institutions and contributing what you can to maintain strong, stable social structures. In groups, you often take on the role of historian, ensuring that new members respect and value the established customs.", "Work Place Habits": "At work, you are motivated by the desire to help others in a practical, organized way. You are driven by your core of personal values, which often include upholding tradition, taking care of others, and working hard.\nYou enjoy work that requires careful attention to detail and adherence to established procedures and like to be efficient and structured in your completion of tasks. You prefer an explicit authority structure and clear expectations.\nYou usually prefer to work behind the scenes, and like to receive recognition in a low-key way without being required to present your work publicly. You want to feel that you have fulfilled your duties, but do not want to be thrust into the spotlight.\nAn ideal job for you involves well-defined work tasks that achieve a concrete or observable result and does not require a lot of multi-tasking. An ideal work environment for you is orderly, provides plenty of privacy, and includes colleagues who share your values.", "How Others Perceive You": "You are characteristically humble and unassuming, and rarely call attention to yourself. You can often be found offering assistance to others in a modest, understated way. you are loyal and hardworking and often commit yourself to tasks and projects with the aim of being helpful to your families, friends, and communities. You are typically involved in social groups, but do not want the spotlight: You are more likely to be found behind the scenes, working diligently to fulfil your role.\nYou are oriented to relationships, but can be reserved with new people. You rarely disclose personal information quickly. You tend to be focused and aware of your surroundings and relate details from your own personal experience. You often converse in terms of what has happened to you and what you have seen first-hand. You are compassionate listeners, and typically remember details about people. You often enjoy hearing the facts about others in the process of making a connection.", "Growth Potential": {"Seek out contact with alien life forms": "You have a tendency to ensnare yourself in your own worldviews and spend far too much time living inside your own heads. As such, you desperately need social contact with people who have different mindsets and ideological inclinations; this type of constructive social interaction can help you become more comfortable with diversity and accepting of social change, and it can prevent you from developing that stern schoolmaster’s countenance that others find so reactionary and off-putting. ", "Speak even when you haven’t been spoken to": "In your dealings with other people you sometimes operate as if your life's purpose is to keep the peace and make everyone happy—everyone except yourself, that is. This habit of suppressing emotions and deferring to the needs of others may seem noble, but in reality, it can trap you in non-productive relationships that won’t make you happy. Speak up for yourself to reach your full potential as a human being. ", "Step outside your comfort zone": "This is good advice for everybody, but particularly for you who tend to get stuck in your routines to the point where you don’t have any time left over for fun and adventure. Take care to connect with your spontaneous, creative side, trying something new every now and then to ensure that your reverence for the tried-and-true does not calcify into rigidity. ", "Lighten up! ": "While your serious and sober attitude may be well-intentioned, a little humour and irreverence from time to time never hurt anyone—you don’t want to be the person who sucks the life out of a room. When you are on the job, in particular, you should realize that fun, laughter and the occasional unplanned coffee break can help relieve stress and build camaraderie, which will only help to boost workplace efficiency in the long run. ", "Don’t worry, be happy": "Caution in the face of the unknown is your standard operating procedure, and it can be paralyzing—stopping personal growth in its tracks. It makes sense to worry in some instances but the incessant worry is like a Death Star to happiness. Let go of the perfectionism every now and then and live a little. It’s only when you relax your strict standards that true happiness will come.  "}, "Careers to Avoid": ["1. Executive", "2. Management Consultant", "3. Sales Manager", "4. Marketing Manager", "5. Financial Manager", "6. Insurance Agent", "7. Copywriter", "8. Art Director", "9. Journalist", "10. Actor", "11. Photographer", "12. Military\t", "13. Mechanical Engineer", "14. Chemist", "15. Attorney", "16. Market Researcher", "17. Economist", "18. Social Scientist"]}, "ISFP": {"Strengths and Weaknesses": {"Strengths": {"Observant": "You are super-observant and seldom overlook any details. However, what makes you so gifted as problem-solvers is that you know how to synthesize what you sense and experience into a coherent whole. You are experts at finding patterns and connections, and this ability allows you to see possibilities for change and improvement that others miss. Best of all, the advice you give and the solutions you recommend are always practical, sensible and capable of making any situation better in the present moment. ", "Bold and spontaneous": "Craving fun and excitement as you do, you know that life is short and that we must seize the moment before it passes us by. You live extremely active lives, boldly pursuing many hobbies and undertaking many exciting projects. You’re also spontaneous enough to leap at chances for new experiences whenever you might appear.", "Principled": "You will not sacrifice your principles for anything, and you have little tolerance for cheaters, liars or hypocrites. Because you are so respectful and find conflict distasteful, you will not confront people who disappoint you, but you will disassociate yourself from those individuals as soon as you possibly can. ", "Individual": "Some people spend your whole lives conforming to established standards and traditions. But you prefer to dance to the beat of your own drummers, relying on your own instincts to reveal what is right, good and true. You don’t do this as a way to gain attention or stand out from the crowd. You simply believe that human nature is complex and varied and that everyone’s path should be unique. "}, "Weaknesses": {"Too sensitive": "Kind and considerate you are so determined to keep the peace that you frequently suppress your unpleasant emotions or ignore your own needs. Putting people first is great, but you too often forget to include yourself among that privileged group. Unfortunately, you are very sensitive and can have your feelings hurt at the drop of a hat, so your habit of deferring to the interests of others to avoid conflict tends to put you in uncomfortable positions time after time.", "Indecisive and unpredictable. ": "You are innovative, flexible and adaptable. But there is a fine line between flexibility and indecisiveness, and sometimes you are so open-minded that you are unable to make firm and final decisions. Too often, you sway back and forth like willows in the wind, changing your minds repeatedly in response to every persuasive argument you hear.", "Easily bored": "You are doers who learn through direct experience and imitation. If the instruction you receive seems too abstract or theoretical, you view it with suspicion, believing this style of teaching to be boring or irrelevant. But this preference can adversely affect your performance as students. Effective learning requires focus and commitment, and you at times are not as dedicated as you should be. This can limit your ability to absorb new and useful knowledge. ", "Lack of future planning": "You don’t always perceive the full consequences of your actions, or understand how the present inevitably shapes the future. Those who refuse to look beyond the immediate horizon may be unprepared for unpleasant happenings or overwhelmed by new duties and responsibilities—such as those that accompany the arrival of a child, for example. As a result, you may struggle with financial affairs, be ambushed by emergencies or fail to notice the way unresolved conflicts can poison relationships over the long term. "}}, "Personality Description": {"Name": "The Symphonist ", "Two Line Description": "You're someone who enjoys serenity in your surroundings and could be a slightly introverted being.", "Description": "You are gentle caretakers who live in the present moment and enjoy their surroundings with cheerful, low-key enthusiasm. You are flexible and spontaneous and like to go with the flow to enjoy what life has to offer. You are quiet and unassuming and may be hard to get to know. However, to those who know you well, you are warm and friendly, eager to share in life's many experiences.\nYou have a strong aesthetic sense and seek out beauty in their surroundings. You are attuned to sensory experience, and often have a natural talent for the arts. You especially excel at manipulating objects and may wield creative tools like paintbrushes and sculptor's knives with great mastery.", "Where do you prefer to focus your energy and attention?": ["1. You gain energy from reflection and lose energy in social gatherings. ", "2. You are passionate and not usually aggressive. ", "3.You are a good listener. ", "4. You are quiet, reserved and self-sufficient.", "5. Gain energy from focusing your mind. ", "6. You are highly Intellectual. ", "7. You are a deep thinker. ", "8. You prefer to work alone and not in groups. "], "How do you grasp and process the information?": ["1. You are observant. ", "2. Your decisions depend on facts and figures. ", "3. You are rational and realistic. ", "4. You focus on the present and have a reasonable approach. ", "5. You use experience and common sense to solve problems.", "6. You apply all your senses. "], "How do you make the decisions?": ["1. You decide with heart and dislike conflict. ", "2. You are passionate and driven by emotion. ", "3. You are empathetic and like taking care of others. ", "4. You pay attention to your moral compass to determine right from wrong and are less interested in the cold, hard facts.", "5. You consider the effect of your actions on other people", "6. you are concerned with values and what is best for the people involved."], "How do you prefer to plan the work ?": ["1. You are spontaneous with the given tasks.", "2. You are a Multitasker. ", "3. You don't need a plan or clarity to start work.  ", "4. You want to be independent. ", "5. You dislike structure and are carefree. ", "6. You tend to be flexible and adaptable. ", "7. You always keep your options open."]}, "Communication Style": "You are gentle, accepting communicators who tend to follow the flow of conversation and look for opportunities to contribute with factual information or practical help. You are easygoing and supportive; you don’t want to be in control or attract attention and are often attentive listeners. Considerate and accepting, you often look for common ground with others. You shy away from conflict or criticism, preferring harmonious, spontaneous interactions that allow you to be helpful and kind.", "Values and Motivations": "You tend to be tolerant and nonjudgmental, but are deeply loyal to the people and causes that matter to them. You endeavour to accept and support other people but are ultimately guided by their own core values. You will typically look for ways to be accommodating and may have difficulty dealing with others who are not willing to do the same.\nYou are typically modest and may underestimate yourself. You usually do not like to be in the spotlight, preferring instead to take a supporting role, and will avoid planning and organizing whenever possible. Sensitive and responsive, you step in to do what needs to be done and are satisfied by their personal sense of being helpful to others.", "Work Place Habits": "You want to feel personally engaged with your work, and seek careers which allow you to express yourself or participate in a cause you believe in. you typically enjoy hands-on activities, and often gain satisfaction when you can create a tangible result from your efforts. An ideal job for you allows you to clearly observe the fruits of your labour, in a context that feels significant and consistent with your values.\nYou like a courteous, cooperative work environment where you can work quietly, with support when you need it. Because you are so tuned to your physical surroundings, it's often important to you that your work environment is aesthetically pleasing.\nYou generally prefer to keep a low profile and do not usually like to be in positions that require you to speak publicly or lead large groups. Although you often prefer to work independently, when you do work with others, you want your colleagues to be flexible, supportive, and loyal to the team.", "How Others Perceive You": "You can be difficult to recognize because of your tendency to express yourself through action rather than words. You may initially appear distant or aloof, but if you watch closely, one can observe you caring in the thoughtful things you do for others. You are carefully observant of the practical needs of other people and often step in with quiet, unassuming assistance at just the moment it is needed. You prefer to take a supportive role and are rarely assertive or demanding of attention. You are typically tolerant and accepting of others.\nYou typically have finely tuned artistic sensibilities. You are sensitive to colour texture, and tone, and often have an innate sense of what will be aesthetically pleasing. You are often natural when it comes to arranging something artistically and enjoy the process of taking in the sensations around you. You focus mostly on the experiences of the present moment, and are rarely ambitious, preferring instead to enjoy the simple pleasures of life: friends, family, and sensory delights such as food, music, and art.", "Growth Potential": {"Choose honesty over harmony": "You do what you can to preserve harmony and promote peace. But in order to avoid having your needs overlooked, you need to express yourself openly and honestly, even if what you have to say may be difficult for others to hear. This can cause strife in the short run, but in the long run, it will help clear up misunderstandings and erase hurt feelings. ", "Develop a wider concept of what it means to be bold and adventurous": "You tend to underestimate your own skills and intelligence. As a result, you frequently choose not to express yourself or volunteer your services unless you are absolutely certain you will receive a positive reception. But when you surrender to these sorts of insecurities, you are actually passing up opportunities for adventure, which you normally crave. There’s a satisfaction to be gained from breaking free of these chains. The results may be unpredictable, but the uncertainty is what provides the challenge. ", "As Michael Jackson used to say, start with the man in the mirror. ": "You have wonderful personal qualities. Your unselfishness and charitable attitude rank near the top of the list of your most attractive attributes. But you are so open-minded, respectful, considerate and polite that you tend to defer to others in virtually every circumstance. Too often, you treat others better than you treat yourself, acting as if your needs are somehow trivial or less important. So every now and then, you should make sure to include your own names on the list of the deserving—preferably somewhere near the top. Charity shouldn’t end at home, but there is no reason why it can’t begin there. ", "Network with dreamers, visionaries and futurists": "You are a bit sceptical of those whose imaginations seem bigger than your accomplishments. In some cases, this is justified, but in general, you could benefit by seeking social contact with people who possess the long-term vision you sometimes lack. Reading autobiographies or downloading video interviews with such folks will also help you gain more insight into the thinking patterns and philosophies of successful entrepreneurs and inventors. ", "Actually make some plans for the future": "It is possible for you to look ahead without abandoning your spontaneity and freedom. “What would I like to be doing five years from now?” “What does the phrase ‘personal growth’ mean to me?” “What would I like my life to look like when I turn 50?” These are the types of general, open-ended questions that can help you focus your creative energies without restricting your ability to make unique, spur-of-the-moment choices. "}, "Careers to Avoid": ["1. Executive", "2. Sales Manager", "3. Marketing Manager", "4. Retail Salesperson", "5. Auditor", "6. School Administrator", "7. Surgeon", "8. Dentist", "9. Psychiatrist", "10. Health Care Administrator", "11. Biomedical Engineer", "12. Biologist", "13. Aeronautical Engineer", "14. Chemical Engineer", "15. Attorney", "16. Judge", "17. Actor", "18. Architect"]}, "ISTJ": {"Strengths and Weaknesses": {"Strengths": {"Perseverance": "You’s main and most admirable strength is perseverance; people of this type simply do not give up. This trait is advantageous to you and can be that which sets you apart in your careers. Your peers and competitors may possess greater skills, but few will match you in dogged commitment. ", "Planning. ": "Because of you’s Judging component, people of this type have a very clear command of time and priorities. You are quite skilled in planning, organizing, mapping out schedules and following agendas. You excel in time management, are punctual (and demand the same of others) and consistently meet your deadlines.", "Detail orientation": "You notice holes, gaps, errors that broader thinkers don’t. You like facts, details and numbers without the emotional or interpretive fluff. And you don’t take facts or information for granted, nor do you rely on it simply because someone else said so. You will check things out for yourself, meticulously.", "Loyalty": "You also have a natural instinct to protect and defend. Loyal, reliable and committed, these are people that can be depended on to guard everything from your families to our nation and these are responsibilities you proudly assume. To the institutions, organizations and people to which you are committed, you are unwavering in your service. "}, "Weaknesses": {"Stubbornness": "While you will be admired for your unwavering commitment to your duty and your sense of what is right and proper, the downside of this is that you can be stubborn, inflexible and dogmatic. You often believe there is one right way (yours) and things must be done that way. Everything else is, by default, wrong.", "Tactlessness": "You are a fierce commitment to truth can also get you in trouble in interpersonal dealings. You tend to speak without much consideration for the feelings of others, thinking it is always more important to be truthful than to make people feel good. You may even experience internal conflict around trying to be tactful or diplomatic, sensing that you are not being completely honest, direct or straightforward.", "Guilt": "You take your work, your commitments and really all aspects of your lives quite seriously and you work hard to plan well and to make wise decisions. When things don’t go as planned, however, you may blame and beat yourself up about it, second guess your decisions and suffer guilt. You will have a hard time simply accepting that sometimes life doesn’t go as planned, and will feel a sense of personal failure and defeat. This can be a source of stress and on-going rumination.", "Resistance to change": "You, in your drive to uphold tradition and do things by the book, can be resistant to change and innovation. Suspicious of new advances and ways of doing things, not only do you experience strain when called upon to embrace change, but you also often stifle creativity or fail to appreciate the benefit of approaching old problems in new ways. This can limit your potential and make you seem especially difficult and stodgy to your coworkers and subordinates."}}, "Personality Description": {"Name": "The Analyst ", "Two Line Description": "You're someone who follows steps and procedures to get work done efficiently, at the same time you're reliable and prefer working alone.", "Description": "You are responsible organizers, driven to create and enforce order within systems and institutions. You are neat and orderly, inside and out, and tend to have a procedure for everything you do. Reliable and dutiful, you want to uphold tradition and follow regulations.\nYou are steady, productive contributors. Although you are Introverted, you are rarely isolated; typically you know just where you belong in life, and want to understand how you can participate in established organizations and systems. You concern yourself with maintaining the social order and making sure that standards are met.", "Where do you prefer to focus your energy and attention?": ["1. You gain energy from reflection and lose energy in social gatherings. ", "2. You are passionate and not usually aggressive. ", "3.You are a good listener. ", "4. You are quiet, reserved and self-sufficient.", "5. Gain energy from focusing your mind. ", "6. You are highly Intellectual. ", "7. You are a deep thinker. ", "8. You prefer to work alone and not in groups. "], "How do you grasp and process the information?": ["1. You are observant. ", "2. Your decisions depend on facts and figures. ", "3. You are rational and realistic. ", "4. You focus on the present and have a reasonable approach. ", "5. You use experience and common sense to solve problems.", "6. You apply all your senses. "], "How do you make the decisions?": ["1. You enjoy technical and scientific fields where logic is important.", "2. You look for logical explanations or solutions to everything.", "3. You make decisions rationally. ", "4. You are task-oriented and focused. ", "5. You are ruled by your head instead of your heart.", "6. You are a critical thinker and oriented toward problem-solving."], "How do you prefer to plan the work ?": ["1. You prefer being organised and live a planned or orderly way of life. ", "2. You like to be involved in tasks where there is a standard procedure and do not like ambiguity ", "3. You like to take charge of things and take responsibilities and leading roles.", "4. You are self-disciplined and decisive.", "5. You don't procrastinate and complete your work on time. "]}, "Communication Style": "You communicate in a direct and straightforward way. You are specific and oriented to details, and often communicate primarily to move a task along. You typically have a great memory for detail and has a vast storehouse of practical, factual information. Most you don’t talk for the sake of talking but will share your knowledge when you see a practical need for it. You are often no-nonsense and action-oriented in your communication; you tell what you know and what needs to be done.", "Values and Motivations": "You like to know what the rules of the game are, valuing predictability more than imagination. You rely on their past experience to guide you and are most comfortable in familiar surroundings. You trust the proven method and appreciate the value of dedicated practice to build confidence in their skills.\nYou are hardworking and will persist until a task is done. You are logical and methodical, and often enjoy tasks that require you to use step-by-step reasoning to solve a problem. you are meticulous in their attention to details, and examine things closely to be sure they are correct. With their straightforward logic and orientation to detail, you work systematically to bring order to their own small parts of the world.", "Work Place Habits": "At work, you are dependable and meticulous. You take deadlines and specifications very seriously and work independently and systematically to complete the tasks you are given. you value a stable work environment with clear expectations and few surprises. you are at your best when you can create detailed plans of action and follow you with little deviation.\nAlthough you may like to do quite a bit of your work independently, you often appreciate the value of participating on a team as well, especially if your colleagues are reasonable and businesslike and there is a clear hierarchy so that you know who is in charge.\nAn ideal job for you allows you to solve logical problems in an orderly way. An ideal work environment for you is quiet, organized, and structured, with rules and regulations that are well established and clearly adhered to by all.", "How Others Perceive You": "You can be difficult to recognize because of your tendency to express yourself through action rather than words. You may initially appear distant or aloof, but if you watch closely, one can observe you caring in the thoughtful things you do for others. You are carefully observant of the practical needs of other people and often step in with quiet, unassuming assistance at just the moment it is needed. You prefer to take a supportive role and are rarely assertive or demanding of attention. You are typically tolerant and accepting of others.\nYou typically have finely tuned artistic sensibilities. You are sensitive to colour texture, and tone, and often have an innate sense of what will be aesthetically pleasing. You are often natural when it comes to arranging something artistically and enjoy the process of taking in the sensations around you. You focus mostly on the experiences of the present moment, and are rarely ambitious, preferring instead to enjoy the simple pleasures of life: friends, family, and sensory delights such as food, music, and art.", "Growth Potential": {"Question the procedure": "Just because it’s “the way it has always been done” doesn’t mean it is the best or the only way. You find comfort in coasting along following the manner in which things have always been done. However, this can mean missed opportunities for growth and development, both personally and professionally. You will benefit from a willingness to break out of the rut of tradition. It certainly isn’t necessary to reinvent the wheel or fix what isn’t broken, but being willing to at least examine and the question is essential. ", "Question the rules": "Your refusal to break the rules, while admirable in some respects, can be unwise. Not all rules are just or efficient, and guidelines aren’t all carved in stone. While respect for authority and laws is generally a good thing, it is the duty of society to actively consider and question and, in doing so, serve as a check on authorities and your exercise of power.", "Be spontaneous": "You have a strong internal sense of time management. While this is one of the mechanisms that enable you to work hard and meet deadlines, it can also be imprisoning. Then you should experiment with not setting a schedule for the day and letting life happen naturally, or try surprising his or her spouse with an unplanned date.", "Get in touch with your feelings": "You, in order to develop and become better-rounded individuals, may need to exert some effort in the emotions department. This will benefit you both in your personal and professional lives. Working to understand and express your own feelings will help to deepen and enliven your friendships and other primary relationships. ", "Make time for leisure and personal development. ": "You often become so laden with the duties of work, family and community that you devote little time to yourself. You, at the very least, need time to consider your lives and to think out the issues you face. You may tend to sideline hobbies because of more pressing responsibilities, but investing time in creative or social endeavours can help you to better fulfil the commitments you see before you and to relieve some of the pressure you experience."}, "Careers to Avoid": ["1. Art Director", "2. Craft Artist", "3. Graphic Designer", "4. Actor", "5. Photographer", "6. Journalist", "7. Musician", "8. Recreation Worker", "9. Restaurant Host", "10. Bartender", "11. Retail Salesperson", "12. Public Relations Specialist", "13. Receptionist", "14. Cosmetologist", "15. Dental Hygienist", "16. Child Care Provider", "17. Preschool Teacher", "18. Speech Pathologist"]}, "ISTP": {"Strengths and Weaknesses": {"Strengths": {"Practical and creative": "The strength of you has frequently been seen in your technical and mechanical skills, from the tuning of a bicycle to the firing of a gun to the repair of a Formula One race car. You are masterful in your use of tools and your ability to fix, repair and make tools and machines work for you. You are also particularly handy around the house and can fix most anything, putting ideas into motion with your hands.  ", "Problem-solving": "You excel in problem-solving because you are able to absorb large quantities of sensory information and categorize it effectively and efficiently so it is ready to be called upon when needed, even in the heat of a stressful moment. Confident in your knowledge and your abilities, you are the doers in any emergency, ready to dive in and take action. You don’t sit on the sidelines paralyzed by the stress, you move into it. ", "Common sense and world-savvy": "The one thing you will never be called is gullible, as this type possesses a keen ability to accurately size up the character and motives of others with striking reliability. People are unlikely to pull one over on you, but if you do, you will be quite distraught over it, not understanding how you might have been duped. ", "Flexible": "You do particularly well in physical endeavours of various types because you are able to insightfully size up your competition and position yourself properly in order to secure the victory. Flexible and adaptable, you improvise quickly in order to respond to the situation, trusting that your bodies and the instincts will guide you."}, "Weaknesses": {"Insensitive": "You tend toward blunt and unsweetened communication and in many ways, this can be a strength because it means you are honest, direct and logical. But in excess, it becomes quite harsh and critical, especially if people don’t meet you’s standards of what constitutes logic, reason or practicality. Rather than accepting that people simply think differently, then you can become irritated when made to deal with a way of thinking that is not natural for you. ", "Risk-seeking behaviour": "You’s restlessness, tendency to become bored and constant pursuit of the thrill can lead you to pursue risky and even reckless behaviours, not fully weighing the costs of your actions. While hedonism is a natural tendency of you, some are particularly unwise in your quest for pleasure, thrills, the adrenaline rush and instant gratification, claiming “you only live once.” ", "Impatient": "You don’t deal well with the inability to move forward, make a decision or act at the moment. Waiting and deliberating is the much greater challenge. Your inability to be patient and your aversion to being bored can fuel you impulsiveness and hedonism in unhealthy ways as you seek your adrenaline fix. ", "Private and reserved": "You have a strong need for personal space and solitude. In and of itself, this preference need not be classified as a weakness, though problems arise when this need dominates and causes you to push others away or avoid intimacy. You can be inordinately protective of you space, your solitude, your schedule and your way of doing things and, like a mama bear, can become quite defensive toward those who seek to move into this space without permission. "}}, "Personality Description": {"Name": "The Specialist ", "Two Line Description": "You're detail - oriented and self - motivated in a way to finding creative solutions to problems you notice around you.", "Description": "You are observant artisans with an understanding of mechanics and an interest in troubleshooting. You approach their environments with a flexible logic, looking for practical solutions to the problems at hand. You are independent and adaptable and typically interact with the world around you in a self-directed, spontaneous manner.\nYou are attentive to details and responsive to the demands of the world around you. Because of their astute sense of their environment, you are good at moving quickly and responding to emergencies. You are reserved, but not withdrawn: you enjoy taking action and approach the world with a keen appreciation for the physical and sensory experiences it has to offer.", "Where do you prefer to focus your energy and attention?": ["1. You gain energy from reflection and lose energy in social gatherings. ", "2. You are passionate and not usually aggressive. ", "3.You are a good listener. ", "4. You are quiet, reserved and self-sufficient.", "5. Gain energy from focusing your mind. ", "6. You are highly Intellectual. ", "7. You are a deep thinker. ", "8. You prefer to work alone and not in groups. "], "How do you grasp and process the information?": ["1. You are observant. ", "2. Your decisions depend on facts and figures. ", "3. You are rational and realistic. ", "4. You focus on the present and have a reasonable approach. ", "5. You use experience and common sense to solve problems.", "6. You apply all your senses. "], "How do you make the decisions?": ["1. You enjoy technical and scientific fields where logic is important.", "2. You look for logical explanations or solutions to everything.", "3. You make decisions rationally. ", "4. You are task-oriented and focused. ", "5. You are ruled by your head instead of your heart.", "6. You are a critical thinker and oriented toward problem-solving."], "How do you prefer to plan the work ?": ["1. You are spontaneous with the given tasks.", "2. You are a Multitasker. ", "3. You don't need a plan or clarity to start work.  ", "4. You want to be independent. ", "5. You dislike structure and are carefree. ", "6. You tend to be flexible and adaptable. ", "7. You always keep your options open."]}, "Communication Style": "You are often a reserved communicator, preferring action to the conversation. You like to do what needs to be done and may grow impatient with a discussion that does not turn quickly to action. You are often observant, picking up on details of the current situation, and evaluate information in a detached and logical way. Typically flexible and tolerant, you are ready to adapt to the situation at hand but can be bluntly critical if you see inefficiency or incompetence.", "Values and Motivations": "You are curious about the mechanics of the world around you and typically have a unique ability to manipulate the tools in their environments. You tend to study how things work and often achieve mastery in the use and operation of machines, instruments, and equipment. You seek understanding, but in a practical sense: you like to be able to put their technical knowledge to immediate use and are quickly bored by theory.\nYou tend to be detached and prefer the logic of mechanical things to the complexity of human emotions. Independent and reserved, you treasure their personal space and want to be free to be spontaneous and follow their own lead. You are selective about their relationships and appreciate others who allow you plenty of freedom to do their own thing.", "Work Place Habits": "At work, you are motivated by a desire to achieve and utilize technical expertise. You enjoy mastering and manipulating the tools of your trade, whatever they may be: the traditional hammers and saws, or the more modern tools of business or technology.\nYou prefer tasks with a tangible result, and typically feel most satisfied when you have built something concrete. You enjoy troubleshooting and often look for occupations that allow you to apply your skills to solve practical problems.\nMany you enjoy occupations that involve physical activity, often with an aspect of risk or danger, and dislike being stuck at a desk. You are most often energized by action and want to jump in to get things done rather than spend much time planning or theorizing.\nYou value efficiency and logic and want flexibility in your work. You prefer a job where you can be practical and action-oriented without being overly burdened by rules, procedure, or bureaucracy.", "How Others Perceive You": "You are typically reserved and even aloof. Tolerant and nonjudgmental, you calmly take in the details and facts of your surroundings, noticing sensory data and observing how things work. You often tune into what needs to be done, taking care of the immediate needs of the moment in a modest, inconspicuous way. You tend to prefer action to a conversation and are often private about your personal lives. You are unlikely to “open up” to new people in a conventional way, but may connect with others by sharing an activity or working together to solve a practical problem.\nyou are good with your hands and often mechanical. You are typically attracted to hands-on hobbies like woodworking or crafts and maybe found tinkering with bicycles, computers, cars, or household appliances. You often have an intuitive understanding of machines and a remarkable ability to fix things. You have an appreciation for risk and action, and often enjoy thrilling leisure activities like extreme sports, motorcycling, or weaponry.", "Growth Potential": {"Make a plan": "You are known for your tendency to avoid long-range planning, preferring to make decisions at the moment and live in the present. This means You often fail to take the steps that can help you to advance in your careers and other areas of life. While you don’t need to take you plan and etch it in stone, it helps to have a general framework in order to make decisions and take the steps that can better facilitate a successful career path. Work on setting goals, making commitments and long-range planning. ", "Balance opportunism": "You inherently understand how to position yourself and work skillfully with the resources and advantages you have in order to succeed. You can, as a result, be exploitative and opportunistic. Then you need to be mindful of his or her goals and motives to make sure that “taking advantage” doesn’t involve taking advantage of someone else. ", "Learn time management skills. ": "As Perceiving types, you prefer to let life come and determine the course of your day, rather than taking a proactive role in deciding how your time will be spent and what you will do. Effort spent on developing time management skills can help you gain better control of his or her time in order to actively prioritize and use this time rather than letting the needs of the day or the moment dictate. Better time management strategies can also help people of this type overcome your natural tendency to procrastinate.", "Stop and reflect": "You get easily caught up in the moment and engaged in the present situation, and once it’s over you’re on to the next. You spend your lives so externally focused that you often fail to set aside time for introspection, for reflection upon your actions and feelings or to learn from your mistakes. You develop as individuals when you will take a break in the action to spend a little time thinking about your lives, your feelings, where you are going, how you need to grow and what your next steps will be. ", "Reframe commitment": "In life, love and work, you are generally hesitant to make commitments. You live in the day and focus your energies in the present. As a result, it is difficult for you to conceive of where you will be or what you will want to be doing at some point in the future. To become people who commit successfully, you can begin to think of your commitments as a daily renewal. One need not declare what ten years from now will look like, it’s only necessary to reframe commitment in terms of many small, daily commitments that over time build up to something resembling a long-term achievement. "}, "Careers to Avoid": ["1. Craft Artist", "2. Reporter", "3. Journalist", "4. Actor", "5. Urban Planner", "6. Market Researcher", "7. Clergy", "8. Social Worker", "9. Preschool Teacher", "10. Special Education Teacher", "11. Social Service Director", "12. Receptionist", "13. Public Health Nurse", "14. Dentist", "15. Occupational Therapist", "16. Family Physician", "17. Paediatrician", "18. Veterinary Technician"]}}